{"_type":"review","_createdAt":"2014-03-09T19:24:32Z","reviewerName":"doug","email":"douggraham@sasktel.net","title":"cooper v","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"had agreat time with captain jimmy and mate johnny.very proffessional and good company.caught 5 and 7 foot sharks lots of smaller fish and took home some delicous jack fillets for supper.would highly reccomend this trip to any angler or family looking for fun in the sun."}]}],"rating":"5","boatReviewed":{"_ref":"139c63fe-2224-4c5a-a486-cef0bc5ab3f4","_type":"reference"},"tripType":"Private  4 hrs."}
{"_type":"review","_createdAt":"2014-03-26T19:24:32Z","reviewerName":"Steve Sasser","email":"ssasser@techcal.com","title":"Start Me Up","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"My complements to Captain Mike and deck hand Jack. The boat was clean and well equipped with the proper rods. Although the fishing was a little slow they did all that was possible to find fish. We caught a couple of nice Mahi Mahi. The best for myself was fishing tuna on a light rod. Never done it but will do it again. Fish in many places and have to say that  Captain Mike and Jack were first class and would ship out with them anywhere . Thanks Start Me Up and Lili Crawford for her recommendation."}]}],"rating":"5","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"Private 8 hr"}
{"_type":"review","_createdAt":"2014-04-01T19:24:32Z","reviewerName":"Jim Dickson","email":"jrd3713@yahoo.com","title":"A Great Day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We took our boys out on the Excellence for a great day.  The fishing was really good and the service was great.   Lyle the deckhand has coastguard and fishing stories that are entertaining and Capt Dennis know where the fish are.  They arranged to have our Ono cooked for dinner locally and it was awesome.  If you want Fun, Luxury, and Fish then look no further!!"}]}],"rating":"5","boatReviewed":{"_ref":"266ad205-8973-4bce-b76d-989df534b7fc","_type":"reference"},"tripType":"8 hour Fishing Trip"}
{"_type":"review","_createdAt":"2014-04-02T19:24:32Z","reviewerName":"Karen Lefebvre","email":"karenlef@shaw.ca'","title":"Cooper V","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I wanted you to know and to please pass along to the crew of the Cooper V (Johnnie and Paul) how much we enjoyed our time with them.  Mike, Charles, Sean and I all agree this was the best adventure we had in Maui.  We were met at the docks by Johnny and escorted to the boat, we met the Captain and headed out.  It was perfect weather and the guys could not have been more accommodating.  Did we want to whale watch or fish?  Did we want to do both?  So we headed out to do some fishing and enjoy the whales at the same time.  Fishing was good, pictures were taken, and stories were born. One of the two were always there to make sure your bait was on the line and making sure that we had a good time.  We all thought we were out fishing with our buddies, that is how well our morning went.   It was actually a little sad for the morning of fishing to come to an end."}]}],"rating":"5","boatReviewed":{"_ref":"139c63fe-2224-4c5a-a486-cef0bc5ab3f4","_type":"reference"},"tripType":"Private charter"}
{"_type":"review","_createdAt":"2014-04-02T19:24:32Z","reviewerName":"Bryan","email":"jollyroger6902@yahoo.com","title":"Slow day, but not due to lack of crew effort.","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"As the title says, it was a slow day.  However, I felt the crew did their best to try to get us on fish...it just wasn\\'t in the cards that day.  I think we were a little late in the season.  If I go again on a subsequent trip to Maui, I will select an earlier month...maybe January or February.  4 stars for effort.  5 stars would have been a Christmas card photo with my son and I holding a Mahi Mahi!  Oh we\\'ll, now I have a reason to go again next time.  Aloha!"}]}],"rating":"4","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6hr Private"}
{"_type":"review","_createdAt":"2014-04-11T19:24:32Z","reviewerName":"Russ Arbuckle","email":"thelaundryman1@gmail.com","title":"Great Service, good fishing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"As a seasoned off shore fisherman, when ever I travel to destinations that offer sport fishing, I usually do a lot of investigation before spending my hard earned dollars on an expensive boat ride.\nWhen I learned that a large group of industry associates were awarded an incentive trip to Maui, I immediately began looking into a charter. I booked directly with a charter company, but when we were two days away from our date I found that several other folks wanted to fish. During my investigations into charter companies I had looked into FishMaui.com and liked what I saw.\nI got on the phone called them and they were able to get us a second boat on really short notice. I personally fished on the Hinatea, and was very pleased. The boat was clean and well kept, the Captain and mate were seasoned professionals and the gear was top of the line and in great condition. \nWe caught 4 yellow fin tuna, and two Mahi, so everyone on board caught fish.\nOn top of that the mate gave us the fillets from the tuna, which we had cut up at out hotel and enjoyed super fresh sashimi around pool side.\nWould certainly recommend these guys to anyone interested in fishing Maui!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Private Charter"}
{"_type":"review","_createdAt":"2014-05-06T19:24:32Z","reviewerName":"Kenley","email":"amykenley@gmail.com'","title":"family fishing trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We took this fishing trip as a family of 6 all of us had a great time. The weather was perfect and they took us right to a perfect spot. We caught 15 fish overall. 13 tuna and 2 Mahi Mahi.  They really new their stuff and new exactly where to go. We lost a few big fish right next to the boat but overall great trip. All my kids and husband were fishing all day. We left really early due to their recommendation and we came back late the trip lasted almost 11 hours total so we did a lot of fishing. We would recommend them and would go out with them again."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hr private"}
{"_type":"review","_createdAt":"2014-05-18T19:24:32Z","reviewerName":"Will Schmitt","email":"wschmitt@partners.or","title":"5/6/14 Charter","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Killer and John were great - very professional - they put us on fish immediately and switched locales and techniques just when it was needed.  10 mahi to 35lbs, 5 tuna (small ahi) and 2 ono to 35 lbs..  a great day of fishing.   It\\'s a long trip out to the FAD beyond Molokai but well worth it.  \r\nI\\'ve fished all over the world and the captain and mate on this ship rank at the very top level in terms of expertise - no nonense.. they get it done.."}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"Troll, live bait"}
{"_type":"review","_createdAt":"2014-05-19T19:24:32Z","reviewerName":"D. Dutcher","email":"D.Dutcher@neopost.com","title":"Had a Great Trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had a great trip. The weather was perfect. Unfortunately, no one caught a marlin. Everyone caught a Tuna. Enjoyed visiting with Pete and Chris was great also.  I would definitely recommend the Hinatea. Glad you had a good time, David! While Hinatea is one of our best marlin boats, they\\'re still not landed every day. We\\'ll just have to get you back to Maui to go fishing again!"}]}],"rating":"4","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8hr share"}
{"_type":"review","_createdAt":"2014-05-20T19:24:32Z","reviewerName":"Daren Redman","email":"darenredman@gmail.com","title":"A fun trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"This was a fun morning. We each caught fish. So we go to yell FISH ON at least 10 times. Some of us caught more than one. One guy even caught one sitting down. The fish were very pretty but they tasted just ok on the grill, I think I needed seasoning. Mike and Monroe were so fun to fish with. This is a \"must do trip\" while on Maui. Lilli took very good care of us and booked the trip. We just showed up and thank goodness not too early in the morn. Get to the harbour early and check out the coffee and muffins at the deli/cafe across the street from the #97 slip. We did not have time to eat our snacks because we were catching fish!! Very clean boat."}]}],"rating":"5","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"Bottom fishing"}
{"_type":"review","_createdAt":"2013-06-12T19:24:32Z","reviewerName":"Han H.","email":"notgiven@fishmaui.com","title":"Fabulous Experience with Reel Luckey","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"What a fabulous experience it was fishing with Capt. Tad! Something that I&#39;ll always look back on with great satisfaction. After departing the harbor and making several stops to catch fresh bait (which was fun in itself), we preceded to Capt. Tad&#39;s first of many secret glory holes. That first stop my fishing buddy and I each landed a amber jack. My fish was 36&#34; long and about 25 lbs.. I landed that with rather light tackle of 30 lb. test line and it was a real battle. We moved again and I landed another amber jack of the same size and an even larger grey snapper. Each time we landed these fish the mate was carefully tagging, letting air out of swim bladder and releasing these fish so they can be caught again by another lucky angler. Before we were done the count for two fishermen was three amber jack, one grey snapper and two sharks. We were totally worn out and very happy. Thanks for referring us to a excellent team on the Reel Lucky."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hour private light tackle"}
{"_type":"review","_createdAt":"2013-04-10T19:24:32Z","reviewerName":"Mike E","email":"donotpublish@me.com","title":"Our family loved the Reel Luckey","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We just got off the Reel Luckey from the fishing trip you recommended to us. Tad Luckey and his crew did a wonderful job. We got into lots of Mackerel early for bait fish, and then landed several AmberJack in the 25 to 35 pound range. The boat was spectacular, and the crew was very professional. My 12 year old grandson landed a 30 pound Amber Jack pretty much by himself. So.. .thanks for the recommendation. It was awesome."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"5 hour private light tackle charter"}
{"_type":"review","_createdAt":"2014-06-17T19:24:32Z","reviewerName":"Robert","email":"Robertmoon.dmd@gmail.com","title":"Great crew. will be back","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Clean boat, great crew just a slow day for fishing will be back though thanks guys."}]}],"rating":"4","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hour"}
{"_type":"review","_createdAt":"2014-06-24T19:24:32Z","reviewerName":"Chris Schnider","email":"chris@overheaddoor-eugene.com'","title":"Fun crew","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"High winds kept us in closer to shore. The fishing was pretty slow, with only a handful of trigger fish and an octopus caught. However, the crew were fun to be around and made the trip enjoyable. When our 4 hours were getting close to expiring, they made the call back to shore to request that they keep us out a bit longer to try and catch some table worthy fish. They kept us out at least another hour to no avail. But it was great to see them continue to try to get us in some more fish. Would try them again."}]}],"rating":"4","boatReviewed":{"_ref":"139c63fe-2224-4c5a-a486-cef0bc5ab3f4","_type":"reference"},"tripType":"4 hour AM"}
{"_type":"review","_createdAt":"2014-06-29T19:24:32Z","reviewerName":"Estelle","email":"Sjresr@gmail.com'","title":"Outstanding","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had the most outstanding, enjoyable trip on the Hinatea with Peter and Greg. The fishing trip was a dream come true for our 13 year old grandson. I would highly recommend the Hinatea and look forward with fishing with them again on our next trip to Maui."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Private"}
{"_type":"review","_createdAt":"2014-06-30T19:24:32Z","reviewerName":"John Bergman","email":"jbconsulting2002@yahoo.com","title":"Grandpa Fishing Trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Greg and Peter were great to fish with. We caught a 20lb Ono in the first 45 minutes, but nothing for the remainder of the trip. My two grandsons had fun, but we wish we could have caught more fish."}]}],"rating":"4","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hour trip"}
{"_type":"review","_createdAt":"2014-06-30T19:24:32Z","reviewerName":"mark kundrat","email":"kundratmark@yahoo.com'","title":"Awsome day fishing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"My family and I spent the day fishing in the beautiful south pacific  0n board the Hinatea.The Captain and mate were as awesome as the boat.We all caught fish and had a great time!!!I would highly recommend  this charter service to everyone.We will definitely be fishing with them in the future!!!!!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Family fishing trip"}
{"_type":"review","_createdAt":"2014-07-05T19:24:32Z","reviewerName":"Curt Schmidt","email":"5schmidt@charter.net","title":"A father\\'s dream","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"My 15 year old daughter and I booked a 6 hour charter last March.  My daughter showed us how to catch lots of Mackerel which we used for bait.  After starting to troll for fish, my daughter caught her first fish, a 35 lb Amberjack.  She continued her streak catching two additonal Amberjack ranging between 25 & 35 lbs. before losing a shark that appeared to be headed to the mainland.  Ended our trip with a great tasting 30lb Grey Snapper.  Tad and his first mate were outstanding.  I\\'d highly recommend Tad and the Reel Luckey!"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hour off shore"}
{"_type":"review","_createdAt":"2014-07-08T19:24:32Z","reviewerName":"John L. Davis","email":"trucks@jldavisandco.com'","title":"My strongest recommendation","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Aloha Lili,\nI wanted you and the boat owner to know what a fine time I had on the Hinatea while entertaining my son and son-in-law. The boat itself was the type of seaworthy craft I personally appreciate. Heavy, rides well in the sea, and sounds like the roar of a big fish attractor.\nFishermen do not need TV’s.\nFirst and foremost were the two Captains. I call them Captains because they were both experienced in all aspects of deep water fishing and worked in perfect unison while remaining friendly, educational, and continuously on the hunt . I have fished with many a crew from the Arctic to the Antarctic. These guys were good. My strongest recommendation.\n\nMany Thanks, \nJohn L. Davis"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hour private"}
{"_type":"review","_createdAt":"2014-07-08T19:24:32Z","reviewerName":"Craig McColl","email":"craig.mccoll@team.telstra.com'","title":"Reunion on Strike Zone.","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Dana and the team were excellent and although the bottom fishing was disappointing we managed to jag two good size Ono\\'s on the way out, which fed everyone in our troop of 40 back at the hotel.\n\ngreat day out!"}]}],"rating":"4","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"6 hours with a combination of trawling for sports fish and bottom reef fishing."}
{"_type":"review","_createdAt":"2014-07-08T19:24:32Z","reviewerName":"Craig McColl","email":"craig.mccoll@team.telstra.com'","title":"8hours trawling on Cuz.","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Unfortunately it just wasnt our day on the high seas. Despite the efforts and persisitence of the crew to ttry to put us on the fish we didint get a hit. We went way out deep to 1000Ft to try for Yellow Fin Tuna and in closer for Ono which were being caught regularly in June/july but it wasnt to be.\r\n\r\nGreat day out and saw hundreds of Dolphins and a few large turtles\r\n\r\nNext time well get em...."}]}],"rating":"3","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"Game Fishing"}
{"_type":"review","_createdAt":"2014-07-12T19:24:32Z","reviewerName":"Liza Pearson","email":"meaapearson@sbcglobal.net'","title":"We had a great day!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Lili, \r\nThank you for matching us up with the Rascal. Captain John and Kamal were very professional, efficient and capable. The boat was so comfortable, which I hadn\\'t expected. We caught 75 lbs of Ono. They shared the fish with us and we have enough for four meals! We had a great day! You made this experience possible. Thank you so much!!"}]}],"rating":"5","boatReviewed":{"_ref":"bdfa0e24-f849-4b2e-9ad9-5bfa85d046bb","_type":"reference"},"tripType":"6 hour share"}
{"_type":"review","_createdAt":"2014-07-14T19:24:32Z","reviewerName":"Ed Stewart II","email":"drfaustus@gmail.com'","title":"Slow day, but I was the lucky one!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"A friend of mine and I booked for June 27th, 2014. It was a slow day, but the captain and mate were super knowledgeable and friendly. The weather was great, the views beautiful and the folks we shared the trip with were very friendly and cool. I lucked out though, as the only the bite of the day was on my line! It wasn\\'t a record breaker, but a 100 lb marlin had lots of fight in my book. I had a great time and thank the captain and mate for their teaching and patience with my \"technique\"! I will definitely recommend this boat to anyone going that way and book them again when I return."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hour shared"}
{"_type":"review","_createdAt":"2014-07-21T19:24:32Z","reviewerName":"John Petrone","email":"John.p.petrone@gmail.com","title":"Excellence Personified","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Where do I begin? Chris (Captain) and Greg (Mate) were fantastic! Tremendous local knowledge and experience, they were able to put us on the hot spot and we landed eight Mahi Mahi and one Yellow Fin tuna. If you are an experienced fisherman you know getting  shut out can happen to the best of them, well the fishing Gods were kind to us  this day, and the crew of the Hinatea were like a well oiled machine! Come with a good attitude and treat the men as the professionals they are, and you will have a great time! I can think of no higher praise. When I\\'m back n Maui I will be booking them again.- Aloha"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"10 hour private"}
{"_type":"review","_createdAt":"2014-08-06T19:24:32Z","reviewerName":"Richard Pulsfort","email":"fester239@yahoo.com'","title":"Great sport fishing trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I am an avid fisherman from NJ on vacation in Maui and wanted to do some sport fishing.  I have fished in Maui before and had a nice catch, but I wanted to catch more fish.  After doing some research I went with \"Action\" Sport fishing.   Captain John and Mate Rob were on the money.  We were on fish from the time we reached the buoy until we left the buoy.  About 4-5 hrs of hard fishing.  We caught mahi mahi, skip jack tuna and tangled with bronze whaler sharks.  At one point we had 3 fish on constantly for about a hour, as fast as we could reel them in and Rob get them in the fish bag.  My arms hurt for the next 12 hours.  If you are into fishing that is a good thing.  I would recommend this boat and trip to anyone who is serious about fishing.  Thanks for a great trip and I look forward to doing it my next visit to Maui."}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"9 hour share"}
{"_type":"review","_createdAt":"2014-08-18T19:24:32Z","reviewerName":"Travis V","email":"mrtravail@outlook.com'","title":"5-star boat and crew","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Our 4 hour bottomfishing trip on Strike Zone was quite fun.  The crew (Junior, Sparky, and Carl) was very helpful and offered advice and assistance very readily.\r\n\r\nOn the way to the first location, 5 sportfishing lures were trolled behind the boat.  I chatted with Junior and he said that the day before was a great day for sportfishing as they caught 11 large sportfish between bottomfishing stops.  Yeah, that was the trip we cancelled on due to what we thought were going to be rough seas.  Upon seeing a big school of baitfish, Junior took us on a slight detour to see if were could hook up with any gamefish.  Sure enough, two of the rods went off and 2 Ono were caught by 2 randomly chosen anglers.  \r\n\r\nBottom fishing bites were really, really slow.  I think the entire boat kept only 7 bottom fish (I got a large trigger that was not edible and was thrown back, while my son got only a few nibbles).\r\n\r\nAt the end of the trip, the sportfish were cleaned and we were given a bag with 6 medium-size pieces of Ono to take home.\r\n\r\nThis was a pretty good trip even on a day when the bite was off.  I would recommend this trip to anyone asking."}]}],"rating":"5","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"4 hour bottom fishing"}
{"_type":"review","_createdAt":"2014-08-19T19:24:32Z","reviewerName":"Andrea Behrend","email":"akbehrend@yahoo.com","title":"Fish tacos!!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Piper, Capt. Jeff, and Sean were awesome.  Incredible boat, excellent way to spend the day, and the tastiest fish tacos EVER (quoted directly from the kids).  Thank you for a wonderful experience!"}]}],"rating":"5","boatReviewed":{"_ref":"5045f9ad-8d50-4c06-a569-b82f20da3abd","_type":"reference"},"tripType":"6hr private"}
{"_type":"review","_createdAt":"2014-08-28T19:24:32Z","reviewerName":"John Wilson","email":"jrwilson@sweetwaterhsa.com'","title":"Great day with Reel Luckey","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had  a great trip fishing on the Reel  Luckey with Brian and Geoff. We caught some Mahi Mahi and some Yellow Fin on light tackle, had a great encounter with huge school of Dolphin and enjoyed some beautiful weather. My three kids really loved the experience and we all got to eat two meals\\' worth of some delicious fillets! Thank you for setting us up on this excellent trip!!"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"8hr Private troll / custom light tackle"}
{"_type":"review","_createdAt":"2014-09-10T19:24:32Z","reviewerName":"Jess monillas","email":"Jmonil@aim.com","title":"The fish that got away","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"If you have limited time to go fishing in Maui this is the charter to choose. The reservation process with Lili Crawford was a breeze. The crew (Captain Jr and Carl) were very professional and friendly. \n\nTen minutes into our trolling we caught a 7lb mahi mahi which made us excited about catching more. When we reached the first fishing area we started catching some keeper fish  (I forgot the names). After several locations Junior took us to spot where he said we might catch Papio. But it was slow so he told us to reel it up so we could move to better spot. \n\nAs we were reeling up our reels my wifes pole suddenly got a big bite which made it bend like it was going to break. Carl immediately knew it was a big papio so he grabbed the net while my wife was reeling it in. Unfortunately, as she was trying hard to land the big fish, the line snapped! It was a heartbreaker! But was exciting. \n\nWe ended up taking home  several medium sized fish for dinner that night. We had fun. Great trip."}]}],"rating":"5","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"4 hour trolling bottom fishing"}
{"_type":"review","_createdAt":"2012-10-02T19:24:32Z","reviewerName":"Mike B","email":"nocontact@email.com'","title":"Nice day, but more fish would have cinched it.","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I just wanted to follow up with a brief fishing report from my day on Rascal. Landed a spearfish early and then had a really slow day. Only one other bite--a mahi that threw the hook before we could get it to the boat. We still had a really nice day cruising. The guys were super. They worked hard and made sure we felt at home, taking time to point out places/things/facts, which was really nice. All in all we had a nice day and would fish on this boat again. I appreciate all of your help getting it all setup."}]}],"rating":"3","boatReviewed":{"_ref":"bdfa0e24-f849-4b2e-9ad9-5bfa85d046bb","_type":"reference"},"tripType":"6 hour private charter"}
{"_type":"review","_createdAt":"2012-06-02T19:24:32Z","reviewerName":"H. Crofford","email":"h.crofford@comcast.net'","title":"Fabulous fishing charter","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We just returned from our trip to Maui and my wife and I want to thank you for helping us with our fishing charter aboard the \"Rascal\". The boat was top-notch and both Captain Kevin and 1st mate Duane were fabulous. Fishing was good and they allowed us to enjoy time with our friends out on the water. The Ono and Mahi Mahi were to die for. A little olive oil, garlic and butter and we were in heaven.\r\n\r\nEnjoy the summer!"}]}],"rating":"5","boatReviewed":{"_ref":"bdfa0e24-f849-4b2e-9ad9-5bfa85d046bb","_type":"reference"},"tripType":"8 hour private"}
{"_type":"review","_createdAt":"2011-05-21T19:24:32Z","reviewerName":"Tim Funkhouser","email":"tfunkhouser@fairpoint.net'","title":"Amazing day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"As you know I was booked on the ACTION (Start Me Up) charter for last Monday. Well the trip was fantastic. There were 6 fishermen on board so we each had a number assigned to each. I was #2 so I actually had more fish time than anyone else! The first time I was attempting to bring in a fish but lost it. Then fishermen #3 and 4 brought in Mahi Mahis. \r\n\r\nAbout 95 minutes later as I was sleeping my reel took off. As it turned out I brought in a 35 pound Mahi Mahi. What a thrill. Then as I was up talking with Patrick about a 500 pound marlin he once caught he looked out over the ocean at something (as you can tell I couldn\\'t see it) and hollered \"Fish on!\" This marlin had struck and the fight was on. I captured one shot that caught white water. The fight lasted about an hour and we had a female blue marlin aboard that weighted in at 380 pounds. I was actually glad it wasn\\'t me doing the fighting as I wouldn\\'t have seen the action that I got to see. I\\'m emailing you to thank you for your recommendation on the Action. If I talk with anyone I will highly recommend Start Me Up charters. Again my thanks."}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"9 hour share"}
{"_type":"review","_createdAt":"2014-09-27T19:24:32Z","reviewerName":"Kurt Kegler","email":"kskegler@acsalaska.ne","title":"ACTION","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Lili,\r\nThanks for the great advice of fishing on the \"Action\". My wife and I had good time. Jukki and Johnny were a great team and very professonal. I would say we had a pretty good day comming in with about 10 Mahi Mahi and 3 Ahi. Hopefully we will be back again next year. Thanks again.\r\n\r\nKurt"}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":""}
{"_type":"review","_createdAt":"2014-10-01T19:24:32Z","reviewerName":"CDNLN","email":"bildungsronin@yahoo.com'","title":"Ahi Ahoy, Mahi Magic: Hinatea Hanapa\\'a","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"As locals who have spent literally thousands of combined hours angling for Maui\\'s nearshore big\\'uns, we know exactly how difficult it is to coax up the trophies: really, Really difficult.  Experts, one supposes, are those who make the difficult look easy.  Experts helm the Hinatea.  Greg and Chris are—for those to whom this sorta thing matters—some kinda fish finders.  They\\'ve got Poseidon on their Rolodex, or somethin\", because they hooked us up with almost a superfluity (it\\'s possible there\\'s no such thing) of striking, leaping, diving, sprinting greens, blues, yellow[fin]s, and chromes.  Fathoms of mahalos to the Hinatea and its matchless crew."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"10 Hr - Private"}
{"_type":"review","_createdAt":"2014-10-08T19:24:32Z","reviewerName":"Francesco Porretta","email":"francesco.porretta@gmail.com","title":"Bottom Fishing/Trolling","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Great Boat, Great Staff, Danielle knew her fishing and helped us pull out some great snapper & tuna! We were on a shared fishing trip and the group was great!"}]}],"rating":"5","boatReviewed":{"_ref":"3b09ef0e-349b-4c6c-8f7c-3a7b1a34899e","_type":"reference"},"tripType":"Bottom Fishing/Trolling"}
{"_type":"review","_createdAt":"2014-10-21T19:24:32Z","reviewerName":"Ed Mattison","email":"mauibeaches2@msn.com'","title":"Start me up","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Went out with Captain Jason-Captain Hook! \r\nHad a great trip slow fishing but did catch a small tuna and a twenty pound Mahi Mahi early in the morning! The crew was also very helpful and informative with any questions we had. We will go out with them again on our next trip!"}]}],"rating":"4","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"6 hour fishing trip"}
{"_type":"review","_createdAt":"2014-10-23T19:24:32Z","reviewerName":"fred oltmanns","email":"fredolt@wcn.net","title":"fished with this company","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"The crew was great nice day on the water. We caught maui mahi, thank you"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8hr"}
{"_type":"review","_createdAt":"2011-08-01T19:24:32Z","reviewerName":"Judith","email":"judith408@earthlink.net'","title":"Disappointed","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Two months in advance we reserved the nine hour action trip. I can not tell you how disappointed we were when we were basically skunked. (One tuna under ten pounds and one ono that another party reeled in) It was a nine hour boat ride. The highlight was the beautiful clear night sky during the ride out and a pod of dolphins later.  It was a once in a lifetime trip for us and it really was depressing to say the least. We had the boat reserved and thought that maybe we would have a small party but they managed to get two more parties to load the boat. I understand that fishing is called fishing and not catching... We just were so depressed.  We did learn that you cant be guaranteed anything and that in slow times business is business. But it is hard to just blow off that much money for a boat ride. To us idiots, we think that catching fish in the middle of the Pacific is a guarantee, even if they are not record breaking size. We have caught fish and know how to fish, and this trip is not for the experienced angler."}]}],"rating":"2","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"9 hour share"}
{"_type":"review","_createdAt":"2010-09-10T19:24:32Z","reviewerName":"R. Archey","email":"ryan1.archey@yahoo.com'","title":"These captains were the best!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Just following up with you about our experience on our charter on 9/4 with Capt. Patrick and Brandon. These two Captains were the best! Camille and I go on a lot of fishing charters over here in Florida but our experience in MAUI was the greatest.  Not only because we caught trophy fish, these guys made our trip really memorable.  They touched on all the safety points and taught us some things about fishing the Pacific Ocean.  Very informative and helpful. I will recommend these guys to all of my friends that plan to go fishing in Maui once they see my pictures and my trophy.  We are already planning another vacation to Maui next year and will not go fishing out there unless these guys are available again.  Hats Off to those two guys and Start Me Up Charters!!!!!\n\nSincerely Ryan and Camille"}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"9 hour private"}
{"_type":"review","_createdAt":"2014-11-13T19:24:32Z","reviewerName":"Mike Blenk","email":"Dnmblenk@gmail.com","title":"Dnmblenk@gmail.com","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Absolutely great day. My sister and I caught so many mahi-mahi and yellowfin tuna that our arms ached! Got my personal best mahi-mahi in a large cow halfway thru the day. Gregg worked hard to put us on fish and Chris was a great cheerleader as to what to do. Can\\'t say enough good things about the boat & crew. Mahalo!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Deep sea"}
{"_type":"review","_createdAt":"2014-11-15T19:24:32Z","reviewerName":"James Kennedy","email":"JKennedy@klmplanning.com'","title":"Mahi on the fly, ono on the down low.","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Out at 0500 .... oh my god it\\'s early .... \nMorning after the luau .... oh my god it\\'s early... \nFilled the live well with mackerel and started fishing.\n\nThe drag on my fly reel was pooched but Brian was able to come up with a washer that fitted the bill and at least I was going to get a shot with the fly rod. Deb hooked up on the fly rod first but it was not for long... strike 1. Tad put us into fish again and we boated 4 Wahoo..... yahoo !!!\n\nFinally on third try with fly rod I hooked up with a nice Mahi Mahi which we managed to land.\n\nWe had a fabulous trip with Tad and Brian on the Reel Lucky.  Will recommend them to anyone who wants to fish out of Lahaina anytime and when I return I will be sure to book a trip on Reel Lucky again. - From Captain - Fly rods aren\\'t used that often here. but Jim brought his own and really wanted to give it a shot, so we rigged him up with one of the opelu and he used that. We had the down-rigger set at the same time. It was just the two of them out there with Brian and I, and Jim\\'s wife only wanted to watch, so when the downrigger went off Jim handed the fly rod off to her while he fought the fish. Then the fly rod went off too. The look on Deb\\'s face when that 40lb ono hit was something to behold!  We had two instances of double hookups that day so Jim was kept pretty busy."}]}], "rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hr lighter tackle private"}
{"_type":"review","_createdAt":"2014-12-14T19:24:32Z","reviewerName":"Scott Dikeman","email":"Scott.Dikeman@Cerner.co","title":"Sunrises, whales and fish","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I wanted to drop you a quick note and let you know what a great time we had on the Reel Luckey. We caught some great fish (65lb barracuda, red and gray snapper) as well as saw a couple whales and  a wonderful sunrise.\r\n \r\nThe crew  did a great job and really enjoyed the morning and experience. I recommend taking this trip to anyone who wants to catch fish and not spend much time getting to where the good fishing is!"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"5 hour private light tackle"}
{"_type":"review","_createdAt":"2014-12-14T19:24:32Z","reviewerName":"Brian Petersen","email":"bdpetersen@gmail.co","title":"Skilled and passionate captain and crew","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain Tad was superbly skilled and clearly knew all the spots.  His downrigger style of fishing produced every one of our 5 hookups that day. The boathand Brian was very knowledgeable and personable and had the lines in the water.  He clearly had a passion for fishing himself and guided shore fishing trips when he wasn\\'t on the Reel Luckey.d"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hours"}
{"_type":"review","_createdAt":"2015-01-22T19:24:32Z","reviewerName":"Alex","email":"alexmoha@yahoo.com'","title":"Great fun with kid","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Great fishing trip!\r\nI took my 8-year son for a 6 hour bottom fish trip and we had great time.\r\nWe were spoilt with awesome whale watching on the Maui waters and caught a tuna when trolling on route to the fishing spot. Awesome bonuses!\r\nBottom fishing was very well organized and we caught many fishes.\r\nThe team was really professional and interested in us spending good time.\r\nThanks to Fish Maui for arranging this!"}]}],"rating":"5","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"Bottom fishing"}
{"_type":"review","_createdAt":"2015-01-24T19:24:32Z","reviewerName":"John W","email":"jewats@aol.c","title":"Best Day Fishing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We booked through FishMaui.com.  We were contacted by Cindy and confirmed a private charter for 6 hours.  We caught a giant Trevally of about 40# before it even got light.  After we fought our live bait, which was fun in itself, we fished for several hours and caught about 15 grey Snapper (Uku).  These guys were the best outfit you could ask for, both captain and deckhand (Tad and Brian).  We have fished saltwater for 40+ years and this would rank as one of the best days we\\'ve ever had.  The fillets were cooked up and were one of the best fish I have ever eaten.  WAY better than Opakapaka.\r\nThanks Tad and Cindy.  We will repeat."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"Live Bait"}
{"_type":"review","_createdAt":"2015-01-29T19:24:32Z","reviewerName":"Carol","email":"tamdcmarsh@yahoo.com","title":"Amazing day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Amazing day on the water with this group! Clean, comfortable ride all day. We’ve been on charters in Alaskan waters, and this was definitely one of the best charter experiences we\\'ve had.  Greg and Jason were excellent company throughout the trip, and so helpful.  Caught baitfish, mahi mahi, and an excellent ono!! Most amazing catch of our life!  To top it off the whales were everywhere amd even got a couple close-ups.  Thanks guys!"}]}],"rating":"4","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":""}
{"_type":"review","_createdAt":"2015-02-01T19:24:32Z","reviewerName":"Travis Marsh","email":"tmarsh@bigblackrubber.co","title":"Fish, Whales and Crew all Awesome","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"It was awesome! it was like a private whale watching cruise also. My sister in law didnt even want to go because she wanted to go on a whale watching cruise with 100 other people. By the end she was all teared up because the whales were everywhere. one was right next to the boat and even swam under us. My 10 year old daughter caught a Mahi Mahi and my son caught a nice Amberjack. It was perfect! Greg and Jason were very nice. In past experiences on charters, the captains always seem to be a**holes. This was not the case at all. This made the experience even better.\r\n\r\nThank you,\r\nTravis"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hour private"}
{"_type":"review","_createdAt":"2015-02-09T19:24:32Z","reviewerName":"J Watson","email":"john@watson-assoc.co","title":"Very successful day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Tad is very good at what he does.  My brother and I  (and our wives, who don\\'t fish) had a very succesful day. We could not have asked for better.  We caught one large giant Trevally and a good number of gray snapper (10-20# range) using live bait.  It sure beat trolling all day and probably not catching much!  The snapper was delicious.  Better than Opakapaka, IMO.  Brian was the deckhand and was terrific.  Great personality and very good at his job.  The day was one of the best I have had in 40 years of salt water fishing!  Thank you for turning us on to them.\r\n\r\nJohn E Watson"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hour private live bait"}
{"_type":"review","_createdAt":"2015-03-25T19:24:32Z","reviewerName":"Steve Hagedon","email":"Steve@hagedon.com'","title":"Had a great time","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Lillie, thanks for hooking me up with the boat “Action”. Had a great time. The boat brought in 3 mahi mahi’s and 5 yellow fin tuna. Five stars in my book!"}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"Share"}
{"_type":"review","_createdAt":"2015-03-25T19:24:32Z","reviewerName":"Rohan B.","email":"rohan.brown@seh-oxford.com'","title":"Bottom fishing with Strike Zone","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"It was a great half day out.  The crew are very professional and obviously keen fishermen.  I caught 7 or 8 fish on the trip; none were big, but there was a good variety of species.  Thanks for your recommendation that I book with them.  I‘d definitely recommend Strike Zone to anyone looking to go bottom fishing on Maui."}]}],"rating":"4","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"6 hour share"}
{"_type":"review","_createdAt":"2015-04-22T19:24:32Z","reviewerName":"Larry","email":"Schlarry270@gmail.com","title":"Maui Mahi","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Great day with John and Rob on the Action Lots of small tuna and some (5) big Mahi. Early morning and rough water but these guys work non stop to get you into some great fish. They tell me yesterday was even better"}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"Early Morning Private"}
{"_type":"review","_createdAt":"2015-05-05T19:24:32Z","reviewerName":"John F","email":"John.Fleming@efi.com'","title":"5 star deal all the way!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Just a quick note that we had a great time with Jeff & Mike on Piper last Monday...\r\n \r\nDespite nasty morning weather, Jeff found clear skies, stayed close to harbor and we brought in a couple nice mahi – we gave one to Jeff and Mike filleted the other and the chef at Ritz made a couple dozen fish tacos for us when we got back –\r\n \r\nPiper is a great boat, they made us feel at home and took all precautions for a safe, enjoyable trip.\r\n \r\nDue to inclement weather at noon-time, Jeff suggested heading back in and adjusted the price accordingly.\r\n \r\nThree of the guys have never set foot on a deep sea boat, so it was a great experience for them.\r\n \r\nAll the Best and Mahalo!\r\nJohn"}]}],"rating":"5","boatReviewed":{"_ref":"5045f9ad-8d50-4c06-a569-b82f20da3abd","_type":"reference"},"tripType":"6 hour private charter"}
{"_type":"review","_createdAt":"2015-05-18T19:24:32Z","reviewerName":"Hunter Allen","email":"hunter.allen@mac.com","title":"Once-In-A-Lifetime Experience!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Amazing, incredible, record-setting day that we\\'ll NEVER forget with Greg and Jason aboard the Hinatea!!  Can\\'t say enough about how easy-going these guys were in welcoming my 11 year-old son and me onto their boat for 6 hours and working their asses off to ensure a great catch and a great time.  \r\n\r\nI should also say that Lili at FishMaui, and Doug - the owner of the Hinatea - were incredibly easy to work with and extremely accommodating in shifting their schedules around to ensure they could have the right boat and the right people available to take us out.\r\n\r\nWhen we got to the dock at 5:30 AM they were ready to go with a clean boat and big smiles, and began immediately to teach us all about their wonderful craft.  By 6:00 we were already trolling and by 7:00 my son had already landed his first fish -- a beautiful, 49\" MahiMahi, which is already headed for my son\\'s wall.  Then we headed for the deeper water, and NOTHING could have prepared us for what came next!\r\n\r\nAround 10:00, we got another hit while I was up top.  Jason and Greg had my son strapped into the chair in a flash, and over the next 50 minutes they scrambled around offering encouragement, instructions and assistance where possible as my son fought a big fish.  Watching them get it into and onto the boat was something I\\'ll never forget.  The end result may very well have been a RECORD for an 11 year-old angler: AN 11\\'8\", 503 LB BLUE MARLIN!!!  Do I need to say more??  The best thing was that Greg and Jason were every bit as happy and excited as we were!\r\n\r\nNot sure what else to say, except that these guys are experts at their craft, work hard to make sure you have a great time, and I absolutely give them my highest possible recommendation.  Thank you, and good luck!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"6-hour Private"}
{"_type":"review","_createdAt":"2015-06-01T19:24:32Z","reviewerName":"Kelli Dwyer","email":"kelligdwyer@gmail.co","title":"Amazing Trip and Crew","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Best day of our trip! I have been to Maui a few times, and have never gone out on a fishing type trip. We chose the 6 hr trip and we were so glad we decided on the longer day! What a great crew. We felt welcome and comfortable from the start. Their expertise and skill allowed us to catch 2 large Mahi Mahi and 3 large Ono fish on one trip. Everyone had a chance to sit in the chair a reel one in. No one would believe that with 3 daughters, this would be the highlight of everyone\\'s trip. I would book another day out anytime we return. Great experience, great time well worth the money. And our grilled fish dinner wasn\\'t to bad either ?."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"6 hr deep sea fishing"}
{"_type":"review","_createdAt":"2015-06-24T19:24:32Z","reviewerName":"Phil Henry","email":"Phillip_Henry@yahoo.com'","title":"Don\\'t Stop Believing!,","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain Greg and First Mate Jason are fantastic. I\\'ve been to Maui a couple dozen times but had never been sport fishing. I decided to take my 3 boys. It was looking 5 hours into it that we were going to get skunked but we were fine as the trip was fun seeing beautiful scenery of Lanai we had never seen and numerous dolphin. However Greg and Jason refused to give up and told us we shouldn\\'t either and at last an awesome Ono struck and Jason\\'s wonderful instruction to getting our amazing dinner reeled all the way in. Two stand up guys I would hire again to take us out again in a heartbeat!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"6 Hour Trolling"}
{"_type":"review","_createdAt":"2015-07-02T19:24:32Z","reviewerName":"Elen & Neil","email":"elenrees@yahoo.com'","title":"BEST DAY EVER","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Booked this trip for the day of my 40th birthday and seriously couldn\\'t have asked for a better experience, from initial contact with the amazing Lili to the day itself. Lili was very knowledgeable in regards to what we were after and she certainly delivered. Greg and Jason were fantastic and our day was epic, from seeing sunrise over Maui to dolphins swimming alongside the boat and many whale sightings even though it was late in the season for them. The fishing consisted of 3 double hook ups which was a lot of fun for my partner and I. We were blessed with a steady catch throughout the day for a total of 5 Mahi Mahi and 4 Wahoo/Ono landed. So much action, will certainly be hard to top! We went home ecstatic and with nearly more fish than we could carry to share over a beautiful meal. BEST DAY EVER."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"10hr private"}
{"_type":"review","_createdAt":"2015-08-10T19:24:32Z","reviewerName":"Ricky Earley","email":"Richardaearley@aol.com'","title":"Hinatea Great Experience","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Five Star Rating\r\n\r\nThese guys really know their stuff. So awesome we went twice. Both captains are awesome and you don\\'t get a better mate than Jason! \r\n\r\nBig Ono big Mahis and a fishing dream come true Blue Marlin for my son Ricky!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Full Day and 6 hour"}
{"_type":"review","_createdAt":"2015-09-28T19:24:32Z","reviewerName":"Jess MONILLAS","email":"jmonil@aim.com","title":"Double back fishing!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captains Brian and Matt accompanied our group of seven in taking us to our early morning bottom fishing. Our first hour was uneventful but the next two hours were exciting when we caught lots of blue lined snappers and some keeper goat fish and some gray snapper.We caught a barracuda but our line was not strong enough resulting to snapping the line out! \r\nTrolling the last hour was fun when my wife caught a mahi mahi and captain Brian decided to double back to the same site hoping we might catch some more mahi mahi, instead we caught a medium sized gray snapper. What a great time we had. Thanks"}]}],"rating":"5","boatReviewed":{"_ref":"3b09ef0e-349b-4c6c-8f7c-3a7b1a34899e","_type":"reference"},"tripType":"Bottom fishing"}
{"_type":"review","_createdAt":"2015-10-15T19:24:32Z","reviewerName":"Shannon Cook","email":"shancook@roadrunner.com'","title":"Best Trip Ever!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Just wanted to let you know our group had the best time on the Hinatea with Greg and Kenny!  They were so polite and knowledgeable, put us on bait fish and 4 uku!  Our group of three couples went and the ladies had just as much fun as the guys.  On our next trip to Maui we would definitely like to give it another go!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8hr private"}
{"_type":"review","_createdAt":"2016-01-14T19:24:32Z","reviewerName":"Earnie Schofield","email":"ada243@msn.com'","title":"A perfect morning on the water","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Back from our trip to Maui and wanted to let you know the fishing trip on 12/30/15 aboard the Pamela was exactly what I was looking to do. Everyone caught fish, Alex and Ann were great guides, the boat was clean and in good repair. All in all a perfect morning on the water. Thank you so much for all of your help."}]}],"rating":"5","boatReviewed":{"_ref":"b6a8a8ba-77e2-4c54-adc3-f6fdd011219b","_type":"reference"},"tripType":"Private bottom fishing"}
{"_type":"review","_createdAt":"2016-01-14T19:24:32Z","reviewerName":"J. Stockman","email":"autumnbeardrums@gmail.com'","title":"Great family fishing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I just wanted to thank you guys again for showing Hunter and I a great time. The last fishing trip we did was for salmon and it didn\\'t end so good. I was afraid he would give up on fishing but the moment you handed him a hot rod with a nice maui-mahi it was all over. That fish gave my boy a blister he was proud to show and even though it did get off my kid had the right attitude thanks to you two.\r\n\r\nBoth he and I want to say mahalo and we can\\'t wait to fish with you again!"}]}],"rating":"5","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"Shared bottom fishing"}
{"_type":"review","_createdAt":"2016-01-14T19:24:32Z","reviewerName":"Eileen Fluehr","email":"efluehr@me.com'","title":"Great day with Kelly and Alex ... great dinner!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"What a great day we had on Sunday aboard the Marjorie Ann with Kelly and Alex. It was the highlight of our three week vacation. We wanted to let Kelly and Alex know how we made out at \"Ko Restaurant\". \r\n\r\nChef Aris met us upon our arrival with our fresh catch. We discussed our preferences for dinner and we left it \"in his hands\"! He served the wavy back tuna in 2 ways. The snapper  was served whole, slightly crispy on the outside on a bed of vegetables in a wonderful sauce. The pa\\'paa was also served 2 different ways ... encrusted in macadamia nuts and also sautéed in a light fennel broth. Chef Aris also came out to the dinner table and chatted with us to ensure our satisfaction. What a memorable day and dinner!"}]}],"rating":"5","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"4 hour shared bottomfish"}
{"_type":"review","_createdAt":"2016-01-14T19:24:32Z","reviewerName":"Grant Nakatini","email":"gnakatani@yahoo.com'","title":"Small boat, great crew","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I got 4 blue lined snapper, pink snapper, and a yellow barbed goatfish (at least that\\'s what Monroe said). Good trip.\r\n\r\nI\\'ve been on charters in San Diego and Kauai and these guys are the best. Small boat with a great crew (Kelly) that gave us lots of attention and instruction.\r\n\r\nThere were two boys on the trip and Kelly was very patient with him. I\\'d recommend them and I would definitely use them again."}]}],"rating":"5","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"4 hour share"}
{"_type":"review","_createdAt":"2016-01-24T19:24:32Z","reviewerName":"Joyce A KAKKIS","email":"DRKAKKIS@AOL.COM","title":"DAY AT SEA","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"WE HAD A GREAT DAY ON THE SEA. WE BEGAN WITH A FULL MOON SETTING ON THE OPEN OCEAN AND A SUNRISE TO FOLLOW. WE LANDED A 40LB SPEARFISH EARLY ON AND LATER A 311LB BLUE MARLIN. WE HAD A GREAT CAPTAIN BRAD AND HIS MATE SAMMY. THEY WERE HELPFUL AND DID A LOT OF HARD WORK TO LAND THESE FISH WITH US. WE WOULD GO AGAIN IN A SECOND."}]}],"rating":"5","boatReviewed":{"_ref":"4608b7a5-9bd4-4c7b-814d-7c93e2c36e08","_type":"reference"},"tripType":"SPORTFISHING CHARTER"}
{"_type":"review","_createdAt":"2016-01-28T19:24:32Z","reviewerName":"Renee","email":"rgoodbrand@yahoo.ca","title":"Best experience of our time in Maui","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"What an amazing day on the Majorie Ann(They also have a sister boat called \"Pamela\". Our best experience of all the things we have done this past week. My husband caught 5, I caught 3 and between the 7 of us we caught 16. Had a fish fry for lunch. Alex and Mike will do their best to give you the bottom fishing experience you can have. Highly recommend these guys. Will be back again! Thanks guys!!"}]}],"rating":"5","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"Bottom Fishing"}
{"_type":"review","_createdAt":"2016-03-15T19:24:32Z","reviewerName":"Corey","email":"corey-kreutz@uiowa.edu","title":"Hinatea sport fishing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I just want to thank you and the crew on the Hinatea for an unforgettable experience. My wife and I had the most wonderful time. The couple we shared the boat with were pleasant as well. We ended up landing 8 tuna and 4 Mahi Mahi. We even enjoyed catching the baitfish. First time in my life I have had 5 fish on one line? The crew did a fantastic job keeping us on the fish and talking us through the process.\r\n\r\nThank You\r\nCorey"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"6hr shared"}
{"_type":"review","_createdAt":"2016-03-17T19:24:32Z","reviewerName":"Teresa Bidleman","email":"weiss676@aol.com","title":"What a great day!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"What a great trip.  We went on the Jun Ken Po with Captain Chris and First Mate Matt and I can\\'t tell you how much fun we all had.  We fish often and the excitement that these guys show with each and every fish we caught was great.  You want someone who wants a fish as bad as you do and Chris and Matt were the guys.  We researched a long time before we booked with these guys as we have done other charters and been discouraged with their lack of effort.  We had 6 people on the 8 hour charter and everyone caught one but one.  Not bad odds 5 out of 6.  They allowed us to clear the lines and put lines back out and even rigged outriggers.  Many times we are told by other charters to sit and wait for the line to release....there was excitement and lots of activity.  They changed things up if they were slow and we learned lots from them.  Would book again in a heart beat.  Thanks Chris and Matt.  This Montana family was very happy and you were right ....the spearfish was excellent eating.  Thanks!"}]}],"rating":"5","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"Private Charter"}
{"_type":"review","_createdAt":"2016-05-09T19:24:32Z","reviewerName":"Dale Otto","email":"dot1301@comcast.net","title":"bottom fishing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I just want to thank the crew of the Cooper V for a most enjoyable time bottom fishing. Had a great time and caught fish too boot. My only regret was, I didn\\'t have time to go out again. Looking forward to next year."}]}],"rating":"5","boatReviewed":{"_ref":"139c63fe-2224-4c5a-a486-cef0bc5ab3f4","_type":"reference"},"tripType":"5 hrs. morning"}
{"_type":"review","_createdAt":"2016-05-14T19:24:32Z","reviewerName":"Andy & Sebrina G.","email":"agoldinger@msn.com'","title":"Mahalo to the crew of Hokua","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We enjoyed the fishing, ride, and views. Capt. Aaron and 1st mate Jordon did a great job."}]}],"rating":"5","boatReviewed":{"_ref":"3b09ef0e-349b-4c6c-8f7c-3a7b1a34899e","_type":"reference"},"tripType":"4 hour charter"}
{"_type":"review","_createdAt":"2016-05-17T19:24:32Z","reviewerName":"Marlin","email":"mdmills7387@msn.com'","title":"Gorgeous Day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Any review of a fishing trip titled Gorgeous Day tells you the fish weren\\'t doing their thing today. Greg and Jason, it was great getting to know you. you got as excited as I did when the strikes came and were just as disappointed when they didn\\'t pan out, for that I thank you. This was a great experience, from connecting with Lili, who made the process seamless, to fish hunting all day in gorgeous blue waters.\r\nIf I can get my son to fly, I will definitely see you for another go at it. Captain Greg, the love of fishing shows, better luck next time out. Jason thanks for the instruction and enthusiasm, best of luck to you! Thank you both for the effort. Glad to meet you!"}]}],"rating":"4","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Private"}
{"_type":"review","_createdAt":"2016-05-20T19:24:32Z","reviewerName":"Joshuah Guzman","email":"jbguzman@rocketmail.com","title":"Incredible Fishing Excursion","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"My best friends and I had the most amazing time aboard the Pamela. Alex and Ana were incrediblely helpful, fun, encouraging, and all around great people. My friends had little to no experience with fishing and the crew was able to help them with ease. This was by far the best fishing charter I had ever been on. In total we caught 15 blue striped snapper and had a shark hooked within 15 feet of the boat. The entire trip was a memory that we will share forever. Alex and Ana made the trip extremely fun and I would highly recommend this trip to anyone with a small group looking for a fun private charter."}]}],"rating":"5","boatReviewed":{"_ref":"b6a8a8ba-77e2-4c54-adc3-f6fdd011219b","_type":"reference"},"tripType":"Private Bottom Fishing"}
{"_type":"review","_createdAt":"2016-05-31T19:24:32Z","reviewerName":"Corey Gerson","email":"corgers@gmail.com'","title":"Great Day!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"These guys put us on the fish! I had some minimul sport fishing experience before, so was excited about the oppertunity to get on a proven \"no-nonsense\" boat. Jon and Rob are pros, these guys know what they are doing. There were some decent waves, and the ride got a little choppy, but when we got to the fishing grounds, we started putting fish in the boat. All 5 clients had a tunu around 30lbs within the first hour of fishing!\r\nTrolling for the rest of the morning was equally productive. We caught 2 swordfish, more tuna, and 3 wahoo, there was a small mahi-mahi caught earlier too. I WILL be fishing with these guys again asap!"}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"Shared sport Charter"}
{"_type":"review","_createdAt":"2016-06-04T19:24:32Z","reviewerName":"Jill & Ron Foster","email":"Chtrbx59@gmail.com'","title":"Rainbow Runner!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Well ..I guess picking the Ace of hearts pulled off for me!\r\nWonderful Trip. Mahalo Greg & Jason . You both obviously enjoy what you do. It was My first time Ever and caught a Rainbow Runner. We will be back! Also, Mahalo Lili from fishmaui for recommending these fine gents!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Shared 8 Hrs."}
{"_type":"review","_createdAt":"2016-06-16T19:24:32Z","reviewerName":"Tracy V","email":"Tracyverbanac@yahoo.com","title":"Best Day Fishing Ever!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Had a fantastic day fishing on the Reel Luckey over Memorial weekend!! Chartered the boat with the whole family and everybody caught fish!, including my 8 -year-old grandson. We caught wahoo, tuna, amberjack, rainbow runner, and mackerel.  So fun!!!  Lili promptly returned my call and helped to book with Lucky Strike Charters and the Captain and First Mate worked hard to get us a catch.  The boat is a very nice ride as well.  HIGHLY recommended!"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hour private charter"}
{"_type":"review","_createdAt":"2016-06-30T19:24:32Z","reviewerName":"Troy Clifton","email":"twclifton@yahoo.com","title":"Family\\'s Dream Day in Maui","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"For our first deep sea fishing trip with our boys (ages 13 and 11), we couldn\\'t have been happier with our choice with Reel Luckey!  Both our boys were able to catch the bait fish that led into some wonderful fishing.  We caught an uku, a great trevally, and an ono.  My boys each got to reel in a monster fish and that made this Dad\\'s dreams come true.  I couldn\\'t have asked for a better boat, crew, and day on the water with my family.  The day was made even better when we got to cook it up for dinner."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"Fishing with Reel Luckey"}
{"_type":"review","_createdAt":"2016-07-01T19:24:32Z","reviewerName":"Charnae LaLuzerne","email":"charnaelaluzerne@gmail.com","title":"Had a Blast; Met Family!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"My husband and I fished with \"the young crew,\" Junior, Jordan, and Chris. Those guys were totally awesome. The fishing was fun, hard work at times, and thrilling. Nearly everyone on the boat caught multiple fish, including a couple larger ones toward the end. The crew cleaned up our fish so we could take it home and cook it up for dinner. So good. The fishing was worth it, but the crew made the entire stay on Maui amazing. It was like meeting family. Junior talked with us the whole time, sharing stories and recommendations for food and friends. We cannot gush enough about how great they are! Can\\'t wait to get back to Maui you guys! Mahalo!"}]}],"rating":"5","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"Bottom/Sport Combo"}
{"_type":"review","_createdAt":"2016-07-19T19:24:32Z","reviewerName":"Robert","email":"Robert@oncommunication.ca","title":"Great day and Crew","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had a great day and Capt Kevin and John made our family feel at home, not easy with teenagers.  Fishing was amazing with a great catch of Wahoo.  Fish dinners where great.  Great boat, great crew and great fishing day, I highly recommend this crew and fish Maui bookings!!   Rob"}]}],"rating":"5","boatReviewed":{"_ref":"bdfa0e24-f849-4b2e-9ad9-5bfa85d046bb","_type":"reference"},"tripType":"6 hr"}
{"_type":"review","_createdAt":"2016-07-28T19:24:32Z","reviewerName":"Ken Katzenberger","email":"kenshellik@aol.com'","title":"They wore us out catching fish","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Lili. Just wanted you to know Action didn\\'t disappoint. They wore us out catching fish. This was my 3rd trip with this boat and every trip has been an experience of a life time. When your back and arms are so tired you can\\'t catch another fish. Not only was I wore out. So we\\'re my 3 sons.  Ages 31, 29, and 26. I would call that a success. Everyone caught the biggest fish of their lives. And we have fished all over the world. Thanks again for a memory of a lifetime. We boated two 100 lb, a 150 lb, a 200 lb, and a 250 lb gray reef shark.  Multiple tuna and wahoo.  Captain John cleaned the fish for us at the dock and we had a fresh fish dinner that night. What a day!!!  Thank you!  Ken"}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"9hr private sport fishing charter"}
{"_type":"review","_createdAt":"2016-07-28T19:24:32Z","reviewerName":"Patrick Herron","email":"pherron2001@yahoo.com","title":"Fantastic Voyage","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain Doug and 1st Mate Jason were beyond excellent - expertly coached my 12 year son into landing a beautiful Marlin on his first deep sea fishing adventure. Spoiled now, I mean really what else can we do except book the Hinatea again! Oh, Mahi and Spearfish were also caught - what a great day on the blue waters of the Pacific and we ate great as well! Thank you Lili and FishMaui"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hr"}
{"_type":"review","_createdAt":"2016-09-01T19:24:32Z","reviewerName":"John Gonzalez","email":"johngonzalez822@gmail.com'","title":"Start Me Up Captain Johnny Hands Down the Best","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Went out on the 10 hour trip out of  Lahaina harbor wit Captain Johnny and his deckhand caught 13 fish in total between the three of us on the trip, as I was informed prior that we needed 4 people to go out, but Johnny took us anyway. The sea was a bit ruff weather was great caught Ono, Mahi Mahi, Tuna Captain Johnny Allowed us to keep most of the fish (which is a plus, but not expected) as we went fishing with him. This was on the Action boat and Thanks Start Me Up and Lili Crawford for her recommendation. I\\'ll will be coming back to go fishing with Captain Johnny."}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"9 hour sport fishing"}
{"_type":"review","_createdAt":"2016-09-27T19:24:32Z","reviewerName":"Stuart Mchaffie","email":"Stuartmchaffie@bigpond.com'","title":"Mahi marathon","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"The preamble says it all. Not for the feint hearted but what a reward for the punter . I went out with no expectations and we caught 32 Mahi Mahi and a nice tuna in rough waters . Fuzzy and decky Sam were awesome . They work mighty hard to get you a fish and we got plenty . It was 15 hours on the boat and a good five  fishing but the luckiest day I\\'ve had on a charter with a hard working crew , as I said no expectations as sometimes it just doesn\\'t happen I\\'m sure . Hats off to fuzzy and Sam , would absolutely recommend that this boat will work hard for you . Thanks to die hard I\\'ll now die happy . \r\n."}]}],"rating":"5","boatReviewed":{"_ref":"6c74f407-92d6-4a24-9462-9d0d9de839ab","_type":"reference"},"tripType":"Shared charter"}
{"_type":"review","_createdAt":"2016-10-12T19:24:32Z","reviewerName":"Sunnetta Capovilla","email":"trentjcapovilla@yahoo.com'","title":"Bucket List Fish","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain Greg and his deck hand were on the ball.  They made sure we and the other guests had a great time, and did their best to find the perfect fishing spots.  We were fortunate enough to hook a blue marlin, and take advantage of the \"fighting chair\" to bring in the 115\", 219 lb beauty.  We made the decision to have a taxidermy version of the fish made for mounting on our wall at home as a permanent trophy/reminder of this one in a lifetime event.  We have already recommended you to our friends."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Sportfishing"}
{"_type":"review","_createdAt":"2016-11-05T19:24:32Z","reviewerName":"R. O\\'Keefe","email":"okeefe817@gmail.com'","title":"Amazing trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Had an amazing trip!  All the crew were awesome.  Will  do it again  soon  I hope. \r\n\r\nThank you Captain"}]}],"rating":"5","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"4 hour shared bottomfish"}
{"_type":"review","_createdAt":"2016-12-08T19:24:32Z","reviewerName":"Marc Rinehart","email":"qsting@msn.com","title":"Color!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Nice four hour trip. Six anglers, 21 fish onboard, including 5 by my wife on her first fishing trip. Boat and crew top notch!!"}]}],"rating":"5","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"4 hour bottom"}
{"_type":"review","_createdAt":"2017-01-08T19:24:32Z","reviewerName":"Tim Farnham","email":"Sayfteebar@comcast.net","title":"Momma knows best","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"\"Best trip ever\". My wife booked the trip for my three boys, a friend and myself and we weren\\'t happy to hear we were leaving the dock at 11:30pm.  What!!!  Boy, does Momma know best, and so does Captain Fuzzy.  We left at 11:30, caught bait and headed out to the fishing ground.  Fuzzy brought us to the perfect location because from then on, there wasn\\'t a dull moment. Captain Fuzzy put us immediately on fish, 22 big eye Ahi, biggest 34 pounds.  Sam the deckhand worked his tail off to help my kids fight fish and have an experience of a lifetime.  If you\\'re in Maui and you want to fish, there\\'s only one boat the \"Die Hard 2\".  Thanks again Captain Fuzzy, tight lines. Mahalo."}]}],"rating":"5","boatReviewed":{"_ref":"6c74f407-92d6-4a24-9462-9d0d9de839ab","_type":"reference"},"tripType":"8 hr"}
{"_type":"review","_createdAt":"2017-01-19T19:24:32Z","reviewerName":"Walt H.","email":"twistedwords1@sbcglobal.ne","title":"Color On","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Great fishing. Fun trip. Very tasty fish. Caught snapper, Blue\r\nTrevally,and some red fish that had big front teeth we\r\nthrew back. Great fun will go again and hope Andy is on\r\nthe boat again."}]}],"rating":"5","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"Bottom fishing"}
{"_type":"review","_createdAt":"2017-01-26T19:24:32Z","reviewerName":"Jim Blessing","email":"blessingwater@sbcglobal.net'","title":"5 star service","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Lili, I wanted to let you know that our trip was fantastic. The fishing was slow but the guys were great to spend the day with and made every effort to put us on fish. We managed a few bottom fish and a tuna. \r\nThey suggested we take them to Pacific O for them to fix for our dinner. We had a party of six, the the dinner experience was awesome. \r\nAppreciate your professional, outstanding service!\r\nMahalo, Jim Blessing\r\n\r\np.s. - And as far as the star rating. I\\'m a life time outdoorsman and those ratings can be misunderstood in my opinion. With that said. 5 star service in my opinion. They were friendly as well as accommodating. The unfortunate thing is that probably 50 % of their clients just wanted to go fishing in Hawaii and miss the \"whole\" experience thing If they dont catch fish. \r\nWe get it!!!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hour private sport fishing"}
{"_type":"review","_createdAt":"2017-01-29T19:24:32Z","reviewerName":"Trace","email":"Larsonta@me.com","title":"Soooo many fish!!!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Whales were everywhere around us while bait fishing in early am! Tuna, Barracudas, and more Golden trevally than we could count - EVERY rig was buzzing with a fish for five of us all pulling in several fish each to the point the cooler was chucked full of fish.  We had so much fun!!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Private 6 hour"}
{"_type":"review","_createdAt":"2017-02-09T19:24:32Z","reviewerName":"Steve Sauve","email":"sgsauve@yahoo.com","title":"","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"What a day! Dave and Chris were terrific hosts.  Dave worked his butt off for us and gave our group of four the most pleasurable day ever.  Four Mahi Mahi and One Ono!\r\n \r\nWe were treated well and the ocean was calm!\r\nThanks to Dave and Chris!!!!!"}]}],"rating":"5","boatReviewed":{"_ref":"266ad205-8973-4bce-b76d-989df534b7fc","_type":"reference"},"tripType":"Full day of fishing"}
{"_type":"review","_createdAt":"2017-02-14T19:24:32Z","reviewerName":"John","email":"Jagleroux@shaw.ca","title":"Cooper V","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Had a great day with Jimmy and first mate Cody....water was very rough but nothing we are not used to....fishing was SLOW and they worked their butts off...we did catch fish for feeding 6 adults for two days so all ended well....and best of all it was not one of the guys who caught the big one...recommend the Cooper V as we also were able to watch near by up whales as they surfaced....all end well had a great day....."}]}],"rating":"5","boatReviewed":{"_ref":"139c63fe-2224-4c5a-a486-cef0bc5ab3f4","_type":"reference"},"tripType":"Private"}
{"_type":"review","_createdAt":"2017-03-21T19:24:32Z","reviewerName":"Jeff Jaeckels","email":"Jajaeckels@gmail.com'","title":"Great day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"My son Blake and I had a awesome day on the rascal fishing with this experienced crew we all caught fish and had a blast doing so thank you for our best day of our 7 day trip.\r\nJeff Jaeckels."}]}],"rating":"5","boatReviewed":{"_ref":"bdfa0e24-f849-4b2e-9ad9-5bfa85d046bb","_type":"reference"},"tripType":"Sport"}
{"_type":"review","_createdAt":"2017-03-22T19:24:32Z","reviewerName":"Steve Berry","email":"berryspatch1@comcast.net","title":"Fantastic Charter","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Groom and groomsmen had a fantastic time catching fish and watching whales. Skipper Tad and Deckhand Garrett made the trip a very memorable time. Although not everyone caught fish, the conditions couldn\\'t have been better. We did bring home enough grey snapper for three days of some unreal grilled fish tacos. Would highly recommend this boat and crew. Thanks so much guys!"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"Private Charter"}
{"_type":"review","_createdAt":"2017-04-03T19:24:32Z","reviewerName":"Jim Davis","email":"Jimtrish247@yahoo.com'","title":"Fantastic Trip !!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain Greg and first mate Jay worked hard to put us on Mahi Mahi and a successful release boatside of a 400 Lb Blue Marlin !!!! Will absolutely recommend to others and book again !!!!"}]}],"rating":"4","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hour offshore"}
{"_type":"review","_createdAt":"2017-04-05T19:24:32Z","reviewerName":"Judy Jacobs","email":"mjjacobs62@gmail.com","title":"AWESOME experience!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain Fuzzy and deck hand/fishing pro Sam worked together like a well-oiled machine to keep us in fish.  The boat is very beautiful and, I don\\'t know how they do it, but it was very very clean and orderly.\r\n\r\nWe caught so many big fish that my arms were sore (but well worth it)!  Be sure and ask them about taking some Bonine before the trip as the water can get a bit rough.\r\n\r\nI highly recommend the Die Hard crew.....They definitely know what they are doing and make the trip a memorable Maui adventure!"}]}],"rating":"5","boatReviewed":{"_ref":"6c74f407-92d6-4a24-9462-9d0d9de839ab","_type":"reference"},"tripType":"Die Hard midnight until morning 4/4"}
{"_type":"review","_createdAt":"2017-04-07T19:24:32Z","reviewerName":"Tim Matheny","email":"Tandtmatheny@aol.co","title":"Great crew","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Recently fished with Captain Brian and crew Matt and La.We had a great time ,caught some fish, had a whale breach not 30yards from the boat ,and was pleased to see the crew stop and pick up some trash we encountered. The captain and crew couldn\\'t have been nicer. Thanks"}]}],"rating":"5","boatReviewed":{"_ref":"3b09ef0e-349b-4c6c-8f7c-3a7b1a34899e","_type":"reference"},"tripType":"Shared bottom fishing"}
{"_type":"review","_createdAt":"2017-04-10T19:24:32Z","reviewerName":"Gene Zawislak","email":"zawislakg@agi.ca'","title":"Fantastic Charter","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"What a great experience. Captain Tad, and Garrett were really great with us. Explaining things, answering questions.\r\nWhile not everyone caught a fish, we did land two really nice Amberjack.\r\nI would highly recommend Reel Luckey."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":""}
{"_type":"review","_createdAt":"2017-04-25T19:24:32Z","reviewerName":"Chris","email":"germanrd@juno.com","title":"I really like these guys!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We went out 4/15/17 with captain Jeremy and Sam.  They told us up front that the fishing had been slow but we went out with great hopes.  They mean it when they say be ready to fish and come early!  The boat ride was long but the sunrise over Maui and the breath taking views off Molokai\\'s coast were worth it!  I have been on other charters and hunting trips and know that sometimes its just not going to happen and its no fault of the Captain and crew.  The morning started promising with lots of birds skimming the water.  We hooked up early with a small Mahi Mahi but then fished for hours without success.  When we started heading home we certainly were feeling down but not out. Had the day ended there I would still give these guys five stars because they really tried.  The boat is great and they Captain and crew were really nice and you can tell they know how to fish.  Now the rest of the story!  About a half an hour into the ride back it happened, a monster marlin lit up one of our poles.  This trip was for my son so he got the chair.  We saw this huge fish come out of the water a couple of times.  I still have goose bumps about it.  The fish took out 800 yards of line and then the battle began!  My son battled the fish for almost an hour and when we thought we were close the unfortunate happened and the fish threw the hook.  Though we all were disappointed I could not have been more thrilled to watch that fight.  The estimate was between 4 and 600 pounds!  I saw it and can believe it.  I am a catch and release type of fisherman so part of me is happy the fish will be out there to give someone else a thrill. On the other hand it would would have been nice to get a picture!  All in all was a great day.  Thanks Jeremy and Sam!  This is a memory my son and I will have for the rest of our lives!"}]}],"rating":"5","boatReviewed":{"_ref":"6c74f407-92d6-4a24-9462-9d0d9de839ab","_type":"reference"},"tripType":"Fishing"}
{"_type":"review","_createdAt":"2017-05-09T19:24:32Z","reviewerName":"CJ Williams","email":"cj.templeton24@yahoo.com","title":"","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"This was our second time charter fishing in Maui and by far my favorite!!!  We only caught one mahi mahi but it was still an amazing trip...  Sometimes the fish don\\'t bite but capitan Brad and Sammy were amazing.  They made this trip super fun and worked really hard to find the fish.  Sammy cleaned the mahi mahi we caught before we even got back to the dock so we could take it across the street and eat it for lunch.  We also had quite a few people in our party get sea sick so Brad was working double time trying to find fish and stay in calmer waters for them.  We will ABSOLUTELY go out again on LuckyStrike II with Brad and Sammy!!!!!!"}]}],"rating":"5","boatReviewed":{"_ref":"4608b7a5-9bd4-4c7b-814d-7c93e2c36e08","_type":"reference"},"tripType":"Private"}
{"_type":"review","_createdAt":"2017-05-24T19:24:32Z","reviewerName":"George lund","email":"georgelund25@hotmail.com'","title":"Awesome day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Left at 230 am and ran through some rough water but it was well worth it. Within 5 minutes of getting to the spot we had a nice size mahi mahi on. Landed  it and the bite at the bouy turned off. Tried several different methods but they just stopped biting. Headed to next spot while trolling. I hooked and landed a nice ono, it was a great fight and I was stoked as I\\'ve never caught one. Trolled on and got slammed one more time but didn\\'t hook it. It nearly tore the lure in half. Great day fishing . Capt fuzzy and crew are true professionals and great guys. Definitely not for the timid. When the first fish hit at daylight all hell  broke loose.  These guys get excited and want to catch fish. I will definitely be booking with these guys next year."}]}],"rating":"5","boatReviewed":{"_ref":"6c74f407-92d6-4a24-9462-9d0d9de839ab","_type":"reference"},"tripType":"8 hr share"}
{"_type":"review","_createdAt":"2017-06-08T19:24:32Z","reviewerName":"Chris Dawson","email":"Chrisdawson77@yahoo.com'","title":"Maui fishing tour","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Let me start it by saying I work in a customer service field and if I had someone treating customers the way I was treated he or she would be looking for a new job!  The fishing was slow but that\\'s not the issue. Fishing can be good or bad.  We had a few hits and one guy landed a striped marlin which was very cool.  The captain of the boat (Chris) was excellent and put us on the fish. My issue is with the 1st mate(Jonny), he was an arrogant asshole from almost the first moment in. Every question I asked was met with a snide comment or just plane ignorant answer.  For example I ask if he ever gets to fish on the boats? His answer \" no why the hell  would i do that I spend enoughtime on the water why would I want to do that.  Even my son and father in law couldn\\'t believe how much of an ass he was. In short great captain, great gear, good boat but I would never spend that kind of money with them again, and would not recommend anyone else spending money there either."}]}],"rating":"2","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"8hr sport fishing"}
{"_type":"review","_createdAt":"2017-06-10T19:24:32Z","reviewerName":"Mark","email":"mtgrabin@q.com'","title":"Bottom Fishing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"This was a great family outing. Wish we would have had another day booked. The 4 hours goes quickly. Great crew and a comfortable boat. We will definitely book another trip when we return."}]}],"rating":"5","boatReviewed":{"_ref":"3b09ef0e-349b-4c6c-8f7c-3a7b1a34899e","_type":"reference"},"tripType":"Shared bottom fishing"}
{"_type":"review","_createdAt":"2017-06-13T19:24:32Z","reviewerName":"Arthur Hill","email":"bunky.hill@yahoo.co","title":"Excellent Fishing Experience!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain John and deckhand Rob are exceptional fishermen and guides. We had a private charter for four us and it was a trip of a lifetime. Within minutes of our baits hitting the water we had a triple hook-up of tuna. My buddy reeled in a 78lb Yellowfin Tuna.  Rob and John got it on the deck and we were back to fishing in short order. We hooked up a gain in about 15 minutes and boated a 98lb Yellowfin! By the end of our time on the fishing grounds we had caught 5 smaller yellow fin and 6 or 7 Skipjack which made excellent Poke. \r\nGreat Trip!  I would definitely book with this boat and crew again."}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"Private Charter"}
{"_type":"review","_createdAt":"2017-06-28T19:24:32Z","reviewerName":"Terri Lucas","email":"tal0975@hotmail.com'","title":"Great Trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I booked a private trip for 3 people.  One adult (female) and two children ages 14 and 15.  We had a GREAT time with Captain Greg and First Mate Jason.  Jason was absolutely EXCELLENT and PATIENT with the children.  They caught some fish, which was nice; but would have enjoyed the trip even if no fish were caught.  I highly recommend this fishing charter."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hour Private Trip"}
{"_type":"review","_createdAt":"2017-07-12T19:24:32Z","reviewerName":"vincent armenta","email":"varmenta@sybmi.org","title":"","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Just wanted to say thank you. The crew made our experience over the top and the fishing was great. We would definitely recommend them to everyone.\r\nVincent Armenta"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hr private"}
{"_type":"review","_createdAt":"2017-08-04T19:24:32Z","reviewerName":"Joan Wilson","email":"wilsonjoannie@gmail.com","title":"They saved us","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"The crew of the Strike Zone saved us in April of 2006 when our cruise ship shore excursion of kayaking off Olowalu did not react as we were swept out to sea in high winds, strong currents and high waves.  We bounced around for several hours before we spotted the Strike Zone.  They LITERALLY saved our lives. Then they did everything they could to take care of us, getting back safely and then back to our group.  So gracious and kind.  So knowledgeable.  We are forever grateful."}]}],"rating":"5","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"Rescue"}
{"_type":"review","_createdAt":"2017-08-04T19:24:32Z","reviewerName":"Martin Miller","email":"Mmiller2001@gmail.com","title":"Great trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Had a wonderful time on the Hinatea and super impressed with Greg and Jason.  They were very hospitable and very hard working to make sure we caught fish.  Fished with both live and artificial bait.  Ended up catching 6 Mahi Mahi and 1 Tuna.  Highly recommend this boat."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Full day"}
{"_type":"review","_createdAt":"2017-08-16T19:24:32Z","reviewerName":"Brandon Dowhan","email":"Brandondowhan@gmail.com","title":"Above and beyond!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Greg and Luke were amazing!! I\\'ve been fishing my whole life and have been in many charters both private and shared, never have I had a crew work as hard as they did to make sure everyone on the boat had a great time and hooked up at least once! We made the long trek out to the buoy on the backside of Lanai and trolled all the way there. It was pretty slow all the way out there, but as soon as we got to the buoy it was all business! Lures came out of the water ,and the smaller tackle w/ squid and tuna strips came out and it was \r\ngame on! Mahi Mahi were hitting hard for about an hour \r\nstraight and these two guys were working HARD! All five of \r\nus hooked up at least once, and some got two. I will only fish w/ these guys on my future Maui trips, period."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"6 hour share"}
{"_type":"review","_createdAt":"2017-08-26T19:24:32Z","reviewerName":"John Hutchings","email":"Jehutchings@icloud.com'","title":"Scratch one off the bucket list","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Just finished one of the best fishing experiences of my life. Landing an Ono (Wahoo) is now crossed off my \\'bucket list\\'. Went out this morning with Captain Johnny and deckhand Pono on a share boat after spending a couple of hours scratching up live bait (not an easy task today, and something that very few other charter boat captains even bother with) we ran hard to a Fish Attracting  Device that Captain John had chosen to be at just as dawn was breaking. That is one of the advantagesof this trip, the ability to be the first boat to the widest selection of FADs or wherever Johnny believes his clients will have the best probability of catching fish. We started with dead baits in order to beat the trigger fish that would try to steal those. Wits once the sun was up a little higher. The Mahi (Dorado) were there and began hitting the baits that were presented but not taking the hook, just the baits. Johnny switched to the live baits we had worked so hard collect earlier and we began to get hookups and bring Mahi to the boat. He then had Pono mix dead baits back in and our hookup rate continued to improve. After landing 10 or so Mahi one of the group boated a small Ahi Yellow Fin. Johnny again switched it up and had Pono replace the bait hooks with skirted lures and we continued to hook and land fish. When the bite slowed a little bit he changed up again to the Kelp Patty special, a 5 1/2 \" silver and pink lure that one of the other captains in fleet has also had success with. Had not been in the water more than a minute or two when it was slammed by an Ono that sawed right through the 80 lb. leader on the strike. Never willing to give into the fish Johnny had Pono dig out the other lure of the same type and rig it to the line on one of the 50s and out it went. Only to meet the same fate a minute or two later. This time I actually saw the Ono come out of the water on the strike and thought he just slammed it and missed. Until I realized that the line on that rod was, once again, just line in the water with no lure. Now it was game on and Johnny had Pono switch to a couple of bent butt 80s with much heavier high speed skirted trolling lures. Meanwhile one of the 50s still out hooked up and the guy in front of me in the rotation landed one of the bigger Mahi caught this morning. It was not long until one of the 80s went off. This time the Ono was not able to saw all the way through the leader on the strike and after stripping a fair amount of line I was able to bring the fish to the boat. Johnny came down from the fly ridge and together he and Pono made certain that I could cross \\'catching an Ono\\' off my fishing bucket list. \r\nI have fished with Captain Johnny since he was a deck hand years ago. And I have always enjoyed his intense desire to catch fish, even on those rare trips where it is more fishing than catching. And suffice it to say that I will continue to fish with John every time I come to Maui until I am no longer able to crank a reel.\r\nIf you want to take the sport fishing trip on Maui with the highest probability of catching, the 2:30 am 9 hr trip on the Action with Captain Johnny is your best possible choice."}]}],"rating":"5","boatReviewed":{"_ref":"7b774135-0c19-4ba1-be5e-a6071c65b619","_type":"reference"},"tripType":"Share boat"}
{"_type":"review","_createdAt":"2017-09-13T19:24:32Z","reviewerName":"Rob Yount","email":"r-yount@sbcglobal.net","title":"A great trip that we\\'ll never forget!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had an excellent 4 hour trip last Friday on the Reel Lucky Strike!  The crew was amazing and went above and beyond.  We had my elderly father on board and he was given all the assistance he needed and even though his  mobility was limited, he was able to reel in 2 nice Mahi (we caught a total of 15 fish!).   A great trip that we\\'ll never forget!  Thanks for the recommendation!"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"4hr private custom live bait"}
{"_type":"review","_createdAt":"2017-09-15T19:24:32Z","reviewerName":"Brian","email":"bvowers@usa.com","title":"Misleading","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We just returned from our fishing trip on the Strike Zone in September 2017. Our reserved \"4 hour bottom fishing\" excursion was misleading. After you troll for sport fish one hour out and one hour back, this leaves you with only 2 hours of bottom fishing. This was not told to me when booking with a live agent nor does it say on the website. Very disappointing."}]}],"rating":"3","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"Bottom fishing"}
{"_type":"review","_createdAt":"2017-10-05T19:24:32Z","reviewerName":"Steven","email":"srn820@verizon.net","title":"Great Day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain and crew extremely attentive to needs of all passengers.  My party included an 87 year old, who they made sure was comfortable throughout the trip.  Would book again if/when we return to Maui."}]}],"rating":"5","boatReviewed":{"_ref":"b37bb084-c64d-44a3-ad88-57223abf1ad3","_type":"reference"},"tripType":"Bottom Fishing"}
{"_type":"review","_createdAt":"2017-10-18T19:24:32Z","reviewerName":"Todd Hamilton","email":"pastortoddzilla@gmail.com","title":"Fantastic Outing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I wanted to give you some feedback on the charter we booked with Captain Tad & the Reel Luckey on October 13, 2017. We had an absolutely fantastic outing!! Tad & Garret could not have been more accommodating, more helpful, or more knowledgable. My 2 daughters, ages 15 and 14, joined me for this trip. Both of these girls are accomplished anglers, having fished with me since they were very young and both have tournament experience. Yet, they each caught their personal best (largest) fish of their lives on this trip! We landed 3 amberjack in the 25-30 lb range and one gray snapper. The rest of the Lahaina fishing fleet landed only one fish that morning. Captain Tad and Garrett use tactics and tackle that give them (and their clients) a distinct advantage over other boats. When we return to Maui we will definitely book this trip again!\r\n\r\nThank you for putting out such a great website with detailed info on each charter company/boat. You really helped me zero in on the charter experience I wanted to have, and we definitely had it!\r\n\r\nSincerely,\r\nTodd Hamilton"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"5 hours"}
{"_type":"review","_createdAt":"2017-11-21T19:24:32Z","reviewerName":"David Orr","email":"dorr598@gmail.com","title":"Slow day, professional crew","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Hi Lili,\r\nJust wanted to give you some feedback on our fishing trip today. Although the fish were not running, I can\\'t speak highly enough of Ross and his deckhand. fantastic professional operators and did everything they could to get us on the fish. They are great guys and a true credit to your business!\r\nCheers,\r\nDavid"}]}],"rating":"4","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"4 hour shared sport fishing"}
{"_type":"review","_createdAt":"2017-12-01T19:24:32Z","reviewerName":"Tim","email":"zebby24@aol.com'","title":"BLUE MARLIN","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Thanks to these guys, we were able to catch a 150lbs blue marlin today.  Best fishing I have ever had in my life."}]}],"rating":"5","boatReviewed":{"_ref":"4608b7a5-9bd4-4c7b-814d-7c93e2c36e08","_type":"reference"},"tripType":"Fishing"}
{"_type":"review","_createdAt":"2017-12-01T19:24:32Z","reviewerName":"Alan Lindsay","email":"Alial@rightleft.com.au'","title":"Great day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Good boat, hard working and nice crew and finished off with 150 lb blue marlin! Couldn’t ask for more- thanks guys"}]}],"rating":"4","boatReviewed":{"_ref":"4608b7a5-9bd4-4c7b-814d-7c93e2c36e08","_type":"reference"},"tripType":"Share"}
{"_type":"review","_createdAt":"2017-12-02T19:24:32Z","reviewerName":"Randal Olstad","email":"olstadrandal@yahoo.com","title":"Fishing Paradise","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"The Captain and Crew went over board to get us into fish. We landed a 78\" spearfish two mahi, and a tuna. WOW!! this is a First Class Charter. \r\nGoing back this year and plan on enjoying the day.  \r\n\r\nLili was extremely helpful matching me up with the Rascal. Thank you Lili!!!"}]}],"rating":"5","boatReviewed":{"_ref":"bdfa0e24-f849-4b2e-9ad9-5bfa85d046bb","_type":"reference"},"tripType":"8 HOUR PRIVATE"}
{"_type":"review","_createdAt":"2017-12-11T19:24:32Z","reviewerName":"Gregg Zurek","email":"gzurek@harpercollege.edu'","title":"Blue Marlin","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Had a great day fishing. One fish but what a beauty. Blue Marlin somewhere between 7-8ft and I\\'m guessing close to 200 lbs. We couldn\\'t lift it off the deck. Will post videos on youtube as soon as I\\'m done editing."}]}],"rating":"5","boatReviewed":{"_ref":"4608b7a5-9bd4-4c7b-814d-7c93e2c36e08","_type":"reference"},"tripType":"Sport Fishing"}
{"_type":"review","_createdAt":"2017-12-26T19:24:32Z","reviewerName":"Doug Meyer","email":"Pdougm@aol.com'","title":"Thanks","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"A big thanks to Chris and Dave for a great day on the water.  You were wonderful with our kids and educated the adults on Hawaii while we waited for the bites.  Happy Holidays!"}]}],"rating":"5","boatReviewed":{"_ref":"266ad205-8973-4bce-b76d-989df534b7fc","_type":"reference"},"tripType":"3/4 Day"}
{"_type":"review","_createdAt":"2018-01-05T19:24:32Z","reviewerName":"Peter","email":"molokaibeachparadise@gmail.com","title":"Captain Jimmy is good.","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain Jimmy and is crew are good.  We are local and fish/dive/hunt/etc a lot.  Normally we wouldn\\'t charter and just fish our own boats, but wanted to give our wives a nicer, bigger boat experience (we have smaller boats 18-21s).  Cooper V is a nice big, comfortable boat with lots of open  space.  \r\nWe did the AM one - vertical jigging in around 300 feet.  We had good action and landed 4 nice kagami by around 10 am.  In my opinion the bite is good from change of light until around 9 am and then on the first tide change.  So basically generally crack of dawn until around 10 am.  Then its the doldrums until afternoon bite which starts around 3:30 pm.  Whether its bottom fishing, trolling for Ahi, live baiting, whatever, this for me holds true.  So basically would recommend you booking Captain Jimmy for the crack of dawn start trip.  Mid-day will almost always be slow.  Aloha."}]}],"rating":"5","boatReviewed":{"_ref":"139c63fe-2224-4c5a-a486-cef0bc5ab3f4","_type":"reference"},"tripType":"4 hr, AM, private, vertical jigging"}
{"_type":"review","_createdAt":"2018-02-18T19:24:32Z","reviewerName":"Joe Downey","email":"Jdowney0920@gmail.co","title":"Lots of fish!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Tad & Garret brought us out on the Reel Luckey fishing boat.  Not only were we really lucky catching Tuna, Amberjack, Giant Travoly, and Mahi Mani’s....these guys were truly awesome!  I would highly recommend them for anyone."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"4 hour private charter"}
{"_type":"review","_createdAt":"2018-03-03T19:24:32Z","reviewerName":"Joe Massey","email":"jmassey42@yahoo.com'","title":"Great trip!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had an amazingly good trip with Johnny (Captain) and Chris (First Mate).  They had the boat setup and ready to go right when we arrived at the marina.  We had a great cruise out to the FAD with some great conversation and entertaining stories.  Once we got out to there, we had a fish in the boat within 15 minutes.  Once we started trolling back towards Maui, we hooked a marlin and had a great fight with it.  Got it in the boat thanks to the excellent direction of Johnny and Chris.  Got back to the marina and weighed and we had a 250 lb marlin and a 50 lb yellow tail tuna.  Awesome day, great guys and we were thrilled with the catch.  I would HIGHLY recommend this company if you want a fun, hard-core fishing trip."}]}],"rating":"5","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"Sport Fishing"}
{"_type":"review","_createdAt":"2018-03-03T19:24:32Z","reviewerName":"Henry & Kristen","email":"henryhez@gmail.com'","title":"Mahalo Hinatea!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I have been on fishing charters before and I can tell you with absolute certainty that this was the best one I have ever experienced! Chris and J. were a joy to fish with. These guys are true fishermen and not salesmen. Their #1 priority is to get you on the fish, no BS, no shenanigans. We didn\\'t catch any trophies but, we did catch fish, and they filleted them out for us and gave us as much as we wanted. The yellowfin and Mahi were delicious! Thanks Chris and J! We will be booking with you again!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Shared"}
{"_type":"review","_createdAt":"2018-03-18T19:24:32Z","reviewerName":"R Moore","email":"ramand4moore@gmail.com","title":"Awesome !","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I\\'ve been on a lot of charters and the Reel Lucky is one of the best.  Capt Tad and Garrett are professional and provide an Awesome experience.  A lot of fishing, not a lot of boat riding.  My 15 yr old daughter and 13 yr old sons caught an amberjack, 2 grey snapper, a blue trevally,  a barracuda, and an island jack as well as the bait we used.  We got to see several whales too. If you can get a trip with this crew, book it.  Don\\'t hesitate."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 Hours"}
{"_type":"review","_createdAt":"2018-03-18T19:24:32Z","reviewerName":"R Moore","email":"ramand4moore@gmail.com","title":"Excellent !","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had an excellent day on the Hinatea.  I\\'ve fished on a few boats in Maui and this was the best offshore trip ever.  The crew was the big difference.  Capt Greg and 1st mate Chris put in the extra effort that it takes.   They have great personalities and are excellent fishermen - we were 10 of 11 on live bait bites and my 13 yr old sons and 15 yr old daughter caught all 10 Mahi-Mahi - the big ones, not the schoolies.  If I can get a charter with this crew, I\\'ll take it."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"8 hr Private"}
{"_type":"review","_createdAt":"2018-03-21T19:24:32Z","reviewerName":"Todd Forsbloom","email":"toddforsbloom@gmail.com","title":"Amazing fishing guides","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Tad and Garrett are truly amazing fishing guides.  They genuinely took on an interest in helping us (which included an 8-year-old and 14-year-old) learn the ropes and they were both very patient.  You can’t fake that type of interest in people, they love what they do, and it shows.  My wife was nervous of the idea of ocean fishing, but the guys kept the boat within sight of the shoreline all morning, they communicated how and what we were going to do…5 stars from us for sure. \r\n\r\nWe caught two GT’s and a few other types of fish, and spent all morning watching whales breach.  Book it, you will not regret it."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"5 hour private light tackle"}
{"_type":"review","_createdAt":"2018-03-23T19:24:32Z","reviewerName":"Jeffrey Zohlman","email":"Jztmzohlman@aol.com'","title":"A Must Do!!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"This is the second time I\\'ve been fortunate enough to go out on one of Start Me Up fishing vessels.  The crew Captain Chris and first mate Johnny were fantastic. Ironically Johnny was the first mate on my last trip seven years ago. Not only did he remember me but he had a photo of the 80lb yellow fin that I landed. Well we unfortunately didn\\'t have any luck this trip it\\'s still was the highlight  of my vacation to Maui.  These guys know what they\\'re doing and ensure that the guests have a wonderful time .   I highly recommend them  and will most certainly be a return customer on my next trip to Maui."}]}],"rating":"5","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"6 hour"}
{"_type":"review","_createdAt":"2018-03-25T19:24:32Z","reviewerName":"Dick Ross","email":"dickross@hotmail.com","title":"Hawaiian Grand Slam!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"My boys and I had a epic day on the Hinatea! 8 mahi, 2 ono, a dozen or more tuna, a 200 lb blue marlin and a 6-7\\' silky shark. That doesn\\'t count how many spit the hook or were eaten by sharks. J and Chris worked their butts off all day long. I have been fishing my whole life and rarely had this much action trolling for fish. Trolling usually is long periods of waiting interrupted with action. Today was the opposite. We barely had time to eat lunch, in fact most of the lunch didn\\'t get eaten until the way in. Thanks J and Chris for an experience my sons and I will never forget!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"6 hour private"}
{"_type":"review","_createdAt":"2018-04-06T19:24:32Z","reviewerName":"Mike Cunningham","email":"Mike@verticalframing.com'","title":"1st Class","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"This is a great boat.  I have fished with professional guides in Maui, Kona, Cabo, East Cape, Yucatan, California, Oregon, Washington.  This boat and crew is at the top of the list.  The boat was 1st class and so was the crew.  We caught fish but if we hadn\\'t it still would have been a successful trip.  I was with my wife and two sons (ages 11 and 13).  At the dock in the morning the captain (Jeff) made us feel welcome and gave a tour of the boat and got us settled.  This interior of this boat is immaculate including the head (wife approved).  The crew (Mike and Marlin) gave us excellent fishing instruction.  The crew did an excellent job teaching my sons how to handle 130 class outfits in a fighting chair.  My wife and sons really enjoyed the entire experience because of the fantastic crew.  The captain is also the owner and it makes a big difference.  I give the Piper and the crew my highest recommendation!"}]}],"rating":"5","boatReviewed":{"_ref":"5045f9ad-8d50-4c06-a569-b82f20da3abd","_type":"reference"},"tripType":"Full day"}
{"_type":"review","_createdAt":"2018-04-07T19:24:32Z","reviewerName":"Brandon Billow","email":"brandob85@icloud.com","title":"Amazing day!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I would just like to say how amazing our trip was! Our captain was Steve Cravens and mate David Bergman.\r\nOur day started with overcast, wind and rain and the crew was constantly changing baits for the best visibility and chances at getting bites. This was my wife\\'s first experience deep sea fishing with me and I was hoping and praying it would be one she\\'d always remember, well it definitely turned that way as soon as the sun started peeking through the clouds.\r\n\r\nOur first hook up was a 15lb Mahi followed by the biggest fish of the day, a 35lb 59\" Mahi just minutes apart. The day was action packed after this and each client (5 of us) hooked up on fish, and I was lucky enough to hook up on 2! I will never forget the look on my wife\\'s face when they yelled Rod 5!! This was assigned to my wife before we started our trip. The adrenaline started racing for both of us and she landed her very first Mahi.\r\n\r\nI just wanted to thank everyone involved and let them know how grateful and appreciative I am for all their hard work getting us on fish and showing us a great time. I will definitely be back!!\r\n\r\nI ended the day getting some nice fillets and put a deposit down with International Fish Mounts to get my fish Mounted. I can\\'t wait to see this beautiful fish on my wall to look at and reminisce on an amazing day on the water with my wife and great company."}]}],"rating":"5","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"8 hour share"}
{"_type":"review","_createdAt":"2018-04-13T19:24:32Z","reviewerName":"Mick Jones","email":"Jonesfampg@gmail.com'","title":"Awesome time","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Jason and Chris were fantastic.  2 adults and 3 teenage boys had a great day.   Couple Mahi Mahi and a striped marlin.   Jason and Chris clearly know and love what they do and it shows.  \r\n\r\nThanks for the awesome day and memories\r\n\r\nMick Jones"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"6 hour"}
{"_type":"review","_createdAt":"2018-04-17T19:24:32Z","reviewerName":"Evan Reid","email":"se.reid@sasktel.net'","title":"Great Fishing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had a great with Johnnie and Matt. A double header with a shark and a huge amberjack to start the day. Followed by many more amberjack and tuna. These guys are lots of fun and they put us on lots of fish. 100% would fish with these guys again."}]}],"rating":"5","boatReviewed":{"_ref":"139c63fe-2224-4c5a-a486-cef0bc5ab3f4","_type":"reference"},"tripType":"AM 6 hr"}
{"_type":"review","_createdAt":"2018-05-28T19:24:32Z","reviewerName":"Jarrett","email":"Rampayge@gmail.com'","title":"Awesome Trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Tad and Garrett were amazing.  They gave us a really amazing experience for our first charter.  Caught a shark, tune and ono.  We will definitely use them again next time we visit Maui."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hour"}
{"_type":"review","_createdAt":"2018-06-16T19:24:32Z","reviewerName":"Gayle Rhea","email":"the-rosa@q.com","title":"Awesome!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had an amazing time!  Jason and Chris went out of their way to help us catch fish and we did!  Two Ono\\'s and one Amberjack!  They were very accommodating and couldn\\'t be nicer.  They were very friendly and great to visit with.  They were obviously very experienced and it was even very interesting watching change lures and tying knots.  They hustled the whole time.  We got to take how ever much fish we wanted and it was delicious!  Highly recommend them!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Sport Fishing Charter"}
{"_type":"review","_createdAt":"2018-06-26T19:24:32Z","reviewerName":"Kyle","email":"tksully76@gmail.com","title":"Great Capt\\'s","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Lots of fun with these guys!  Beautiful boat, nice equipment, and we were lucky to have beautiful weather.  Would have been nice if it were calmer, and more fish were biting, but that\\'s why it\\'s fishing and not catching."}]}],"rating":"5","boatReviewed":{"_ref":"266ad205-8973-4bce-b76d-989df534b7fc","_type":"reference"},"tripType":"Private Charter"}
{"_type":"review","_createdAt":"2018-07-11T19:24:32Z","reviewerName":"Tim pistoresi","email":"Tim.pistoresi@ubs.com'","title":"Great day fishing with Captain Duane","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"After going last year with a group of friends, I booked the boat myself this year. Rhapsody Lunes from the Marriot hotel joined me to fish and help. \r\nCaptain Duane took us about two thirds of the way to Lanai and we began to fish in about 150 feet of water. \r\nFrom that point on I had a fish on!! Caught several good eating fish like Nabetta and Papio. Hooked two sharks during the day over 5 feet in length which we released. Fished hard right up to 11 am. \r\nCap Duane was an excellent host and Rhaposdy was a great add on guide since he is the “fish whisperer”! He actually thinks like a fish???. \r\nAll said, totally worth the 900 bucks for a great day of fishing off Maui’s coastline!!\r\nI’d urge anyone to try this trip!!\r\nWe left in a dingy of the beach in front of whalers village and boarded the Mercury a ways from the beach. \r\nA bit challenging but also very very nice if you’re staying at a Kaanapali beach hotel. \r\nIf you’re an avid fisherman and you want to catch fish while in Maui , without enduring the high seas of the sport fishing world, then this trip is for you. \r\nA Great day fishing while on Maui!!!!"}]}],"rating":"5","boatReviewed":{"_ref":"e8d8e996-97dc-4667-a28b-d551c8fff916","_type":"reference"},"tripType":"Bottom fishing"}
{"_type":"review","_createdAt":"2018-07-15T19:24:32Z","reviewerName":"David Rakeshaw","email":"david.rakestraw@gmail.com","title":"Great trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We caught 6 ahi total, 1 Mahi Mahi, and one nice Ono.  (Plus a shark which was released.)\r\n\r\nThe crew (Sam and Jay) were very nice. They told us to take as much fish as we wanted and gave us suggestions on how to cook it.  Upon request, Sam walked us over to a restaurant and arranged for them to cook us some of it for dinner that night.  Overall we had four meals from the fish we caught and they would have given us more if we wanted.\r\n\r\nWe would definitely use the Die Hard again.  We saw others coming in without fish.  Going early (on our way at 10:20pm) to catch bait fish, catching most of the ahi before sunrise, and going to the proven locations to fish despite the rougher waters were all key to their success."}]}],"rating":"5","boatReviewed":{"_ref":"6c74f407-92d6-4a24-9462-9d0d9de839ab","_type":"reference"},"tripType":"8hr private"}
{"_type":"review","_createdAt":"2018-08-01T19:24:32Z","reviewerName":"K. Corallo","email":"krista@coopink.com","title":"Great time fishing","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I just wanted to let you know that my family had a great time fishing today. Brad and Drew (turtle) were patient and very nice to my family. Would highly recommend them to people. Customer service was perfect. Plus we caught fish so it made for a even better day. \r\nKrista"}]}],"rating":"5","boatReviewed":{"_ref":"4608b7a5-9bd4-4c7b-814d-7c93e2c36e08","_type":"reference"},"tripType":"6hr private"}
{"_type":"review","_createdAt":"2018-09-08T19:24:32Z","reviewerName":"Michael Hovland","email":"Michaelhovland@msn.com'","title":"Awsome trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"I planed this trip with my son and a couple of friends with no expectations but hoping for some good fishing.  Chris was awsome at getting us on some fish . Although we only landed 2 Mahi Mahi. It was well worth the trip.  Dana his deck hand was constantly changing baits trying to get some strikes .  Couldn’t be happier with our trip.  Watching my son reel in his first larger game fish was worth every penny.\r\nThanks Chris for making it happen."}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Private"}
{"_type":"review","_createdAt":"2018-10-09T19:24:32Z","reviewerName":"Brian B","email":"bbodmer@gmail.com","title":"Excellent Trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"A great experience from start to finish. Chris knows what he is doing and they work extremely hard to get the fish. We didn\\'t get a Marlin strike, but caught 7 nice Mahi-Mahi for the day. I took enough home to feed the group and everyone loved the way Chris told me to prepare it. It\\'s fishing, so nothing is guaranteed, but they will do everything they can to get you some action. Thanks again!!!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Share 6 hours"}
{"_type":"review","_createdAt":"2018-10-12T19:24:32Z","reviewerName":"Megan H","email":"megan.hill.dvm@gmail.com'","title":"AWESOME day of fishing!!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had an awesome time fishing with Chris and Dana!!  They worked hard all day to get us on fish. We caught 4 Mahi and had a blast. An experience our sons won’t forget. Thank you so much for a fantastic day!!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Private fishing charter"}
{"_type":"review","_createdAt":"2018-11-27T19:24:32Z","reviewerName":"Jameson and Karen","email":"jameson_murray@yahoo.com","title":"Awesome Trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"My wife and I had a great time! The crew, Junior, Derek and Jack were extremely knowledgeable and quick to assist. I highly recommend Strike Zone for all ages and experience levels. Love that any fish we did not take home will be donated to those in need."}]}],"rating":"5","boatReviewed":{"_ref":"f9bb630d-edbe-4dee-9b7c-12e109ad615e","_type":"reference"},"tripType":"Bottom Fishing"}
{"_type":"review","_createdAt":"2018-12-31T19:24:32Z","reviewerName":"Dave Nebeker","email":"dnebeker@juno.co","title":"Wonderful Family Trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Captain Tad and deckhand Garrett pulled out all the stops and put us on some great fishing, so much that their giant Yeti cooler was full before the sun came up--and before most of the other fishing boats had left the harbor.  We caught 4 snappers and 4 trevally, would have been five but a ten foot tiger shark had a different plan right at the boat.  Garrett who works at a fish market as well prepared the fillets and it was a thing of beauty!  We took home about 40 pounds of filets-fed our family for a week!  They really knew how to take care of us and especially my elderly father in law.  We drove within 50 feet of the boat and dropped him off and they did a great job putting him in a great spot so he could catch fish and not have to move much.  Any future trips to Maui will include fishing with Captain Tad on the Lucky Strike!  You will catch fish with him (46 years of experience)."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hour"}
{"_type":"review","_createdAt":"2019-01-20T19:24:32Z","reviewerName":"Kostas Marianos","email":"kmarian343@gmail.com'","title":"Great experience, great trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Coming from the Mediterranean (GREECE) I have been fishing since I was a kid. This trip however and fishing in the Pacific Ocean with Hinatea was a unbelievable experience. The colors of the sky at dawn, the sound of the whales around us and the beautiful views of the Maui mountains as the sun was rising, was something I will always remember and cherish. All this combined with a great boat and a very professional crew (Captain Chris and Lucas), made it a superb trip. We caught one 20lb Mahi and two 6-7lb blue Taralis, which we ate for lunch a couple of hours after we returned. Awsome experience all together. Thank you Hinatea and crew!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"Fishing"}
{"_type":"review","_createdAt":"2019-01-26T19:24:32Z","reviewerName":"Julie Berry","email":"berrykevin@sbcglobal.net'","title":"Worth Every Penny","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"This was an unforgettable day that we will cherish forever! We are family of six with four kids ages 19, 17, 14, and 11. We began in the early morning and started catching fish right away. All of my kids caught incredible fish. Tad and Garrett were so nice, helpful, and interesting to talk to. My 11 year old really bonded with Garrett and ran back down the pier to get a selfie with him and Tad at the end of the trip. It is even at his urging that I do this 5 star review. It was so cool catching fish while spotting whales in the background. The memory of this outing is on the list of highlights of my life. Thank you Tad and Garrett!"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hour with Reel Lucky"}
{"_type":"review","_createdAt":"2019-02-07T19:24:32Z","reviewerName":"Matt Ward","email":"ak2thdr@yahoo.com","title":"These guys know how to fish","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Went fishing today with Captain Jimmy and John. What an amazing trip. These guys know how to fish. I have chartered all over and consider these guys the best. Took my wife and 10 year old twins for their first ocean fishing experience and can’t tell you how accommodating and professional these gentlemen were. Caught multiple species and just had fun!! Will be booking again in the future. Thank You for an amazing experience!!"}]}],"rating":"5","boatReviewed":{"_ref":"139c63fe-2224-4c5a-a486-cef0bc5ab3f4","_type":"reference"},"tripType":"5 hour private light tackle"}
{"_type":"review","_createdAt":"2019-02-12T19:24:32Z","reviewerName":"Tim","email":"tvhoffman@rogers.com","title":"Excellent Excursion","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"My son and I joined three others for a great morning of bottom fishing.  Even though the weather was challenging friendly captain and crew Maddy, Taylor and Adam provided a really great fishing experience.  Nearby whales was an added bonus.  Would highly recommend even for amateurs like us!"}]}],"rating":"5","boatReviewed":{"_ref":"b6a8a8ba-77e2-4c54-adc3-f6fdd011219b","_type":"reference"},"tripType":"Shared Bottom Fishing"}
{"_type":"review","_createdAt":"2019-02-26T19:24:32Z","reviewerName":"Don Sterk","email":"donsterk@outlook.com","title":"Best Day Ever","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Went with Captain Timmer Putnam and Chris. Left at 2:30 am and went out 4 hours,I slept on the way. When we got there Chris gave me a lesson on how to handle a big one. Once he put the lines in the water it was ON! I started catching Mahi Mahi one after the other. I was so excited and tired that Timmer asked if I wanted a break. I told “I may never get a day like this and i am not getting out of this chair” When the bite finally stopped i caught 18 fish from 10 to 30 lbs. We trolled for marlin on the way in but no hookups, but that didn’t matter. I will never forget that day and the crew of that boat. Chris worked his tail off and was so pleasant and professional. As I said Best Day Ever! Don Sterk"}]}],"rating":"5","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"Private trip"}
{"_type":"review","_createdAt":"2019-03-09T19:24:32Z","reviewerName":"karyb","email":"karyburin@gmail.com","title":"Fish On!  Mahi Mahi and a beautiful day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Andy and Cap\\'n Kamal were the best hosts and entertaining experts on all things Hawaiian sports fishing.  It was a rescheduled trip and we were happy to be aboard!  We caught a 19#, 4\\' Mahi Mahi, enough for everyone to take home steaks for the bar b q.  Couldn\\'t have asked for a better crew, nice weather and some line action."}]}],"rating":"5","boatReviewed":{"_ref":"bdfa0e24-f849-4b2e-9ad9-5bfa85d046bb","_type":"reference"},"tripType":"Sport Fishing for 6 hours open chater"}
{"_type":"review","_createdAt":"2019-03-25T19:24:32Z","reviewerName":"Kyle Dagestad","email":"kyledagestad@hotmail.com","title":"Trevally Time","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"The weather was cooperative, and the fishing was consistent. we didn\\'t catch a lot of small fish, but we did land a number of big fish. My wife Amy landed a Mirror Trevally and some blue-lined snapper, and I burned my arms off fighting this GT. A great time was had by all. Captain Alex and deck hand Michael kept us entertained."}]}],"rating":"4","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"Bottom Fishing"}
{"_type":"review","_createdAt":"2019-04-05T19:24:32Z","reviewerName":"Nicki Gibbs","email":"Ngibbs@beehivepr.biz'","title":"Fantastic Five Hour Trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"This is our second trip to Maui and our second fishing charter. We will definitely be back and plan to book again with Captain Tad and Garret.  \r\n\r\nThe trip was smooth, and while the fishing season is cooling off, both of my teenage daughters landed fish. We also saw a number of whales while we were out.  They were thrilled. \r\n\r\nTad and Garret we’re friendly, professional and knowledgable. The Reel Luckey was clean and comfortable.\r\n\r\nMahalo and see you next time."}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"Private charter"}
{"_type":"review","_createdAt":"2019-04-09T19:24:32Z","reviewerName":"Pharaoh","email":"pharaohgraham17@gmail.com","title":"What a trip!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"These guys were top notch! Greg and Dana did everything to put us on fish and it paid off.  My dad and I were able to land 4 ono, but one of them was an almost 50 pound ono! These guys are knowledgeable and a good crew to be around!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"6 hour"}
{"_type":"review","_createdAt":"2019-05-29T19:24:32Z","reviewerName":"Matt","email":"mattmiller@gmail.com","title":"Start Me Up ACTION","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"What a day we had on the Action! Amazing crew and great fishing. We caught mahi-mahi, Tuna, Ono and even a 150lb Marlin, which they released. I thought it was awesome to see them release such a beautiful fish. I recommend anyone who actually wants to catch a bunch of fish to go with them. Capt Jonny and Deckhand Jon are pros."}]}],"rating":"5","boatReviewed":{"_ref":"fff46c74-0800-47ef-8214-212de9049980","_type":"reference"},"tripType":"9 hour"}
{"_type":"review","_createdAt":"2019-07-02T19:24:32Z","reviewerName":"Leanna","email":"leanna.creager@kroger.com","title":"Great Fishing Day","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We had the best time on this boat and with this crew.  Chris and Dana were awesome!  For the first four hours, it was kind of quiet, but we did see a bunch of dolphins!  Then in the 5th hour, we caught 6!  We had a triple bite-two mahi and a wahoo.  Such a great experience!  I would recommend these guys for a perfect day of fishing!"}]}],"rating":"5","boatReviewed":{"_ref":"862cf1b4-2e30-4a32-a79c-9125a85e35dc","_type":"reference"},"tripType":"6 Hour"}
{"_type":"review","_createdAt":"2019-12-15T19:24:32Z","reviewerName":"Ryan Herzog","email":"ryedog1@hotmail.com'","title":"Family trip","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Started the day with introductions and safety walkthru.  Left harbor and were fishing for bait in half hour.  Captain Steve and Joel know what theyre doing and dont mess around.  Its not often you can take a family of 6 fishing and everyone catch fish until theyre tired.  Excellent tidy boat, gear in good shape, great experience.   If youre looking for a great charter,  this is your boat."}]}],"rating":"5","boatReviewed":{"_ref":"6f61e245-e947-4b52-bb9e-8e6597c68b4e","_type":"reference"},"tripType":"Combo private"}
{"_type":"review","_createdAt":"2019-12-18T19:24:32Z","reviewerName":"Brandon Sigfried","email":"bhsiegfried@gmail.com","title":"Nice Sunrise","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"We booked the Lucky Strike II for an 8 hour trip.  Not one bite but we saw a nice sunrise for $1500.   LOL"}]}],"rating":"2","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"Sport Fishing"}
{"_type":"review","_createdAt":"2020-01-31T19:24:32Z","reviewerName":"James Brotzman","email":"Brotzy23@aol.com'","title":"Amazing Family Fishing Trip!!!","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"What an amazing family fishing trip!! We booked this boat for a 4 hour private charter. We had 7 of us. 4 adults and 3 kids aged 14, 12, and 8. Alex and Adam greeted us upon arrival and couldn’t be nicer. They were so helpful all day and very knowledgeable. The trip starts by trolling to the fishing spot for bigger game fish and possible bait to use, we did catch a small tuna on the way which was fun for my 14 year old to reel in. We saw a ton of whales all around us. At the fishing holes we caught a wide variety of fish. Some were even pretty rare. Highlighted by a puffer fish at the end by my daughter. That was crazy to see all puffed up. Overall we easily caught over 20 fish. Would definitely recommend this boat!! Thanks again Alex and Adam! They were very informative all day!!"}]}],"rating":"5","boatReviewed":{"_ref":"cf8d545a-f4ac-4457-85b0-f0647abc990b","_type":"reference"},"tripType":"Bottom fishing"}
{"_type":"review","_createdAt":"2020-02-11T19:24:32Z","reviewerName":"Kurt and Mindy Biedermann","email":"kbieds61@gmail.com'","title":"Amazing experience","blockContent":[{"_type":"block","children":[{"_type":"span","marks":[],"text":"Just wanted to send you a note about the amazing experience we had on our fishing trip aboard the Reel Luckey.  Captain Tad and Garret greeted us warmly and since we had calm water took us across from Lahaina between Molokai and Lanai to fish. They are wonderful guides and were as excited as we were while fishing.\r\n\r\nEnjoyed an amazing sunrise and immediately caught fish on our first drop. Between us we caught eight large fish (Snapper, Trevalley, Ulua and Amberjacks), over 20 baitfish mackerals and even had a shark on for a while. Could not have asked for a better experience !!"}]}],"rating":"5","boatReviewed":{"_ref":"3923c202-8d10-483b-a5ce-66cd68862fa0","_type":"reference"},"tripType":"6 hour lighter tackle sport fishing"}
